<?php

return [
    'ru/blog/students' => [
        'title' => 'Как стать программистом: советы и рекомендации',
        'metaDescription' => 'Узнайте, как стать успешным программистом. Полный перечень технологий, языков и подходов, которые помогут вам в карьере. Реальный взгляд на профессию от опытного веб-программиста.',
        'h1' => 'Как стать программистом: напутствие будущим специалистам',
        'url' => 'https://shitik.com/ru/blog/students',
        'preview' => 'https://shitik.com/images/blog/2019/students/students.jpg',
        'date' => [
            'htmlFormat' => '2019-06-12',
            'viewFormat' => '12 июня 2019',
        ],
        'titleForIndexBlog' => 'Как стать программистом: советы и рекомендации',
        'descriptionForIndexBlog' => 'Не так давно я общался с одной хорошей знакомой, которая учится на программиста. В процессе беседы я понял, что у нее такой же (неправильный на мой взгляд) образ жизни, как у большинства других студентов. Такой же, как был у меня и всех моих друзей. Дабы помочь ей взглянуть на реальность программирования, и мотивировать уже сейчас...',
        'status' => 1
    ],
];