<?php

return [
    // 2022
    'ru/blog/books-2022' => [
        'title' => '22 книги в 22ом году!',
        'metaDescription' => 'Полный список книг, которые успел прочитать за 2022 год.',
        'h1' => 'Прочитанные книги в 2022 году',
        'url' => 'https://shitik.com/ru/blog/books-2022',
        'preview' => 'https://shitik.com/images/blog/2022/books-2022/books-2022.jpg',
        'date' => [
            'htmlFormat' => '2022-12-29',
            'viewFormat' => '29 декабря 2022',
        ],
        'titleForIndexBlog' => 'Прочитанные книги в 2022 году',
        'descriptionForIndexBlog' => 'Текущий год не обошелся без массового чтения книг. К сожалению по ряду причин количество прочитанных книг в этом году по сравнению с...',
        'stutus' => 1
    ],

    'ru/blog/run-2022' => [
        'title' => 'Итоги бега за 2022 год',
        'metaDescription' => 'Результаты бега за 2022 год. Сравнение показателей с предыдущими годами',
        'h1' => 'Результаты бега за 2022',
        'url' => 'https://shitik.com/ru/blog/run-2022',
        'preview' => 'https://shitik.com/images/blog/2022/run-2022/run-2022.jpg',
        'date' => [
            'htmlFormat' => '2022-12-28',
            'viewFormat' => '28 декабря 2022',
        ],
        'titleForIndexBlog' => 'Результаты бега за 2022',
        'descriptionForIndexBlog' => 'Пришло время подвести итоги бегового 2022 года. Сначала рассмотрим таблицу всех пробежек в году, после чего дам некоторые комментарии...',
        'stutus' => 1
    ],

    'ru/blog/world-cup-2022' => [
        'title' => 'Стать Чемпионата мира по футболу 2022',
        'metaDescription' => 'В Катаре совсем скоро стартует чемпионата мира по футболу 2022. Ценность соревнования, главные фавориты, бомбордиры и прочие факты',
        'h1' => 'Чемпионат мира по футболу 2022',
        'url' => 'https://shitik.com/ru/blog/world-cup-2022',
        'preview' => 'https://shitik.com/images/blog/2022/world-cup-2022/world-cup-2022.jpg',
        'date' => [
            'htmlFormat' => '2022-01-18',
            'viewFormat' => '18 ноября 2022',
        ],
        'titleForIndexBlog' => 'Чемпионат мира по футболу 2022',
        'descriptionForIndexBlog' => 'На днях стартует чемпионат мира по футболу. Это самое ценное и важное соревнование в карьере каждого футболиста. Ценность добавляет то, что в отличие от многих других видов спорта чемпионат мира по футболу...',
        'stutus' => 1
    ],

    'ru/blog/seo' => [
        'title' => 'Современные поисковые системы',
        'metaDescription' => 'Что не так с соверменными поисковыми системами? Поисковые системы будущего.',
        'h1' => 'Современная СЕО-оптимизация глазами программиста',
        'url' => 'https://shitik.com/ru/blog/seo',
        'preview' => 'https://shitik.com/images/blog/2022/seo/seo.jpg',
        'date' => [
            'htmlFormat' => '2022-07-16',
            'viewFormat' => '16 июля 2022',
        ],
        'titleForIndexBlog' => 'Современная СЕО-оптимизация глазами программиста',
        'descriptionForIndexBlog' => 'Уже около 5ти лет я работаю в продуктовой компании в области финансов, экономики и бизнеса. Помимо этой предметной области у нас есть вторая не менее важная...',
        'stutus' => 1
    ],
];