<?php

return [
    // 2023
    'ru/blog/total-2023' => [
        'title' => 'Итоги года: достижения, цели и здоровье',
        'metaDescription' => 'В этой статье рассказываю о достижениях в течение года, основных целях, фразах года, спорте, работе и здоровье и много другом. Узнайте, какие цели были достигнуты, какие препятствия возникали и как автор заботится о своем здоровье.',
        'h1' => 'Итоги 2023 года',
        'url' => 'https://shitik.com/ru/blog/total-2023',
        'preview' => 'https://shitik.com/images/blog/2023/total-2023/total-2023.jpg',
        'date' => [
            'htmlFormat' => '2023-12-29',
            'viewFormat' => '29 декабря 2023',
        ],
        'titleForIndexBlog' => 'Итоги 2023 года',
        'descriptionForIndexBlog' => 'Неоднозначный год, хотя судя по всему вполне успешный. Перейду сразу к целям на год, которые ставил, и тому, насколько мне удалось их осуществить. Было 5 основных целей. Цель 1 - достигнута на 100%, Цель 2 - достигнута на 100%,Цель 3 - достигнута на 50%, Цель 4 - достигнута на 25%, Цель 5 - достигнута на 100%...',
        'status' => 1
    ],
    'ru/blog/books-2023' => [
        'title' => 'Ревизия моей библиотеки: удаление и добавление книг, приоритеты и статистика чтения в 2023 году',
        'metaDescription' => 'В этой статье я рассказываю о ревизии моей библиотеки, удалении ненужных книг и добавлении новых. Узнайте о моих приоритетах, статистике чтения в 2023 году и рекомендациях по лучшим книгам.',
        'h1' => 'Книжная статистика за 2023 год',
        'url' => 'https://shitik.com/ru/blog/books-2023',
        'preview' => 'https://shitik.com/images/blog/2023/books-2023/books-2023.jpg',
        'date' => [
            'htmlFormat' => '2023-12-29',
            'viewFormat' => '29 декабря 2023',
        ],
        'titleForIndexBlog' => 'Книжная статистика за 2023 год',
        'descriptionForIndexBlog' => 'В этом году я провел ревизию своих книг: удалил часть того, что точно не буду читать и вместе с этим скачал около 400 новых книг. Уже в момент скачивания я обращал...',
        'status' => 1
    ],
    'ru/blog/run-2023' => [
        'title' => 'Статистика моего бега в 2023 году: рекордное расстояние и интересные графики',
        'metaDescription' => 'В этой статье я подводю итоги своего бега в 2023 году. Узнайте, какое расстояние я пробежал, какие рекорды установил и какие графики отображают мои достижения.',
        'h1' => 'Статистика бега за 2023 год',
        'url' => 'https://shitik.com/ru/blog/run-2023',
        'preview' => 'https://shitik.com/images/blog/2023/run-2023/run-2023.jpg',
        'date' => [
            'htmlFormat' => '2023-12-27',
            'viewFormat' => '27 декабря 2023',
        ],
        'titleForIndexBlog' => 'Статистика бега за 2023 год',
        'descriptionForIndexBlog' => 'Конец года, а значит самое время подвести статистику моего бега. И хоть в этом году у меня была краткосрочная, но очень неприятная болезнь, это не сильно отразилось на моем беге в этом году...',
        'status' => 1
    ],
    'ru/blog/tips-for-motorists' => [
        'title' => 'Неочевидные советы для начинающих водителей: избегайте распространенных ошибок',
        'metaDescription' => 'Изучите неочевидные и полезные советы для начинающих водителей, которые помогут вам избежать неприятностей на дороге. Собранные из жизненного опыта автора, эти советы дополнят вашу подготовку к вождению и повысят вашу безопасность. Будьте внимательны и готовы к непредвиденным ситуациям, чтобы стать опытным водителем.',
        'h1' => 'Неочевидные советы начинающим водителям',
        'url' => 'https://shitik.com/ru/blog/tips-for-motorists',
        'preview' => 'https://shitik.com/images/blog/2023/tips-for-motorists/tips-for-motorists.jpg',
        'date' => [
            'htmlFormat' => '2023-12-26',
            'viewFormat' => '26 декабря 2023',
        ],
        'titleForIndexBlog' => 'Неочевидные советы начинающим водителям',
        'descriptionForIndexBlog' => 'В начале этого года у меня вышла статья, почему водители не любят зиму. В продолжение этой тематики решил написать еще одну.В автошколе помимо изучения ПДД и практики тот, кто ведет лекции, часто рассказывает свои негласные правила...',
        'status' => 1
    ],
    'ru/blog/fear-of-criticism' => [
        'title' => 'Почему мы следуем моде: психологический анализ и симптомы страха перед критикой',
        'metaDescription' => 'В этой статье мы исследуем, почему многие люди стремятся быть модными и менять свою одежду и вещи регулярно. Мы рассмотрим психологическую проблему, связанную с потребностью в моде, и описываем 7 симптомов страха перед критикой. Если вы замечаете себя в этих симптомах, возможно, вам стоит обратить внимание и позаботиться о своей уверенности и самооценке.',
        'h1' => 'Страх перед критикой или почему люди гонятся за модой',
        'url' => 'https://shitik.com/ru/blog/fear-of-criticism',
        'preview' => 'https://shitik.com/images/blog/2023/fear-of-criticism/fear-of-criticism.jpg',
        'date' => [
            'htmlFormat' => '2023-12-23',
            'viewFormat' => '23 декабря 2023',
        ],
        'titleForIndexBlog' => 'Страх перед критикой или почему люди гонятся за модой',
        'descriptionForIndexBlog' => 'Мне всегда была интересно, почему многие люди гонятся за модой. И ладно если бы новая вещь была на несколько поколений новее чем та, которая у тебя есть. iPhone 14 конечно же более современный, чем например 8. А автомобиль 2020 года как правило всегда комфортнее и безопаснее, чем автомобиль 2000 года или хотя бы 2010 года...',
        'status' => 1
    ],
    'ru/blog/space-objects' => [
        'title' => 'Изучение космоса: открытия и технологии, которые изменили нашу повседневную жизнь',
        'metaDescription' => 'Узнайте, как изучение космоса стимулирует прогресс и приводит к разработке новых технологий. Изобретения, созданные для космических целей, нашли применение в повседневной жизни. От складных транспортных средств до солнечных батарей и компактных датчиков - узнайте о том, как космос влияет на нашу технологическую эволюцию.',
        'h1' => 'Бытовые и медицинские предметы, которые появились благодаря изучению космоса',
        'url' => 'https://shitik.com/ru/blog/space-objects',
        'preview' => 'https://shitik.com/images/blog/2023/space-objects/space-objects.jpg',
        'date' => [
            'htmlFormat' => '2023-12-16',
            'viewFormat' => '16 декабря 2023',
        ],
        'titleForIndexBlog' => 'Бытовые и медицинские предметы, которые появились благодаря изучению космоса',
        'descriptionForIndexBlog' => 'Одну из первых статей про изучение космоса я начну с того, что само по себе изучение космоса является двигателем человеческого прогресса и улучшения повседневного быта человека. Астрономия - эта та отрасль, которая занимает огромную статью годового бюджета...',
        'status' => 1
    ],
    'ru/blog/following-in-the-footsteps-of-hocking-and-tyson' => [
        'title' => 'Изучение космоса: загадки вселенной и шокирующие открытия',
        'metaDescription' => 'Откройте для себя загадочную вселенную и тайны человеческой натуры. Узнайте, как появилась вселенная и является ли она бесконечной. Погрузитесь в мир космоса и узнайте о последних открытиях, которые могут шокировать вас. Будьте в курсе новейших исследований и развития космологии. Подпишитесь на блог и получайте регулярные обновления о захватывающих открытиях и событиях в космосе.',
        'h1' => 'Иду по стопам Хокинга и Тайсона',
        'url' => 'https://shitik.com/ru/blog/following-in-the-footsteps-of-hocking-and-tyson',
        'preview' => 'https://shitik.com/images/blog/2023/following-in-the-footsteps-of-hocking-and-tyson/following-in-the-footsteps-of-hocking-and-tyson.jpg',
        'date' => [
            'htmlFormat' => '2023-12-9',
            'viewFormat' => '9 декабря 2023',
        ],
        'titleForIndexBlog' => 'Иду по стопам Хокинга и Тайсона',
        'descriptionForIndexBlog' => 'Некоторые люди считают человека загадочным существом, ставят его в центр существования вселенной и стремятся познать все тайны человеческой натуры. Такие люди изучают психологию. Некоторые люди идут еще дальше и считают изучение самой вселенной более интересной затеей. Как вы могли понять...',
        'status' => 1
    ],
    'ru/blog/winning-lotteries' => [
        'title' => 'Выигрышные минские лотереи. Секрет ракскрыт.',
        'metaDescription' => 'Разбираем почему в Минске и области лотерии выигрывают чаще, чем в других регионам Беларуси',
        'h1' => 'Выигрышные минские лотереи',
        'url' => 'https://shitik.com/ru/blog/winning-lotteries',
        'preview' => 'https://shitik.com/images/blog/2023/winning-lotteries/winning-lotteries.jpg',
        'date' => [
            'htmlFormat' => '2023-08-12',
            'viewFormat' => '12 августа 2023',
        ],
        'titleForIndexBlog' => 'Выигрышные минские лотереи',
        'descriptionForIndexBlog' => 'В моем детстве и подростков возрасте были очень популярные лотереи ваше лото и супер лото. Не знаю судьбы этих лотереей сейчас, возможно какая-то из них существует и сейчас...',
        'status' => 1
    ],
    'ru/blog/weight-and-mass' => [
        'title' => 'Вес или масса? Как правильно?',
        'metaDescription' => 'Как правильно говорить вес или масса. Разбираем оба понятия.',
        'h1' => 'Почему некорректно спрашивать какой у тебя вес? Отсеиваем двоечников по физике',
        'url' => 'https://shitik.com/ru/blog/weight-and-mass',
        'preview' => 'https://shitik.com/images/blog/2023/weight-and-mass/weight-and-mass.jpg',
        'date' => [
            'htmlFormat' => '2023-08-11',
            'viewFormat' => '11 августа 2023',
        ],
        'titleForIndexBlog' => 'Почему некорректно спрашивать какой у тебя вес? Отсеиваем двоечников по физике.',
        'descriptionForIndexBlog' => 'Очень часто можно услышать фразу какой у тебя вес?  Давайте разберемся что с ней не так и почему она максимально странная. В самой по себе фразе-вопросе...',
        'status' => 1
    ],
    'ru/blog/marvel-and-dc-without-a-plot' => [
        'title' => 'Кризис идей и проблемы с сюжетом у компаний Marvel и DC',
        'metaDescription' => 'Какие типовые проблему я обнаружил в сюжетных линиях ведуших компаниях, снимающих фильмы по комиксам.',
        'h1' => 'Кризис идей и проблемы с сюжетом у Марвел и DC',
        'url' => 'https://shitik.com/ru/blog/marvel-and-dc-without-a-plot',
        'preview' => 'https://shitik.com/images/blog/2023/marvel-and-dc-without-a-plot/marvel-and-dc-without-a-plot.jpg',
        'date' => [
            'htmlFormat' => '2023-08-06',
            'viewFormat' => '6 августа 2023',
        ],
        'titleForIndexBlog' => 'Кризис идей и проблемы с сюжетом у Марвел и DC',
        'descriptionForIndexBlog' => 'Я не большой фанат серии Marvel и DC, но некоторые самые популярные и хайповые фильмы все же видел. Это и не удивительно, ведь ровно как...',
        'status' => 1
    ],
    'ru/blog/rich-brazil-and-argentina' => [
        'title' => 'Если бы у Бразилии и Аргентины было больше денег',
        'metaDescription' => 'Что было бы, если бы Бразилия и Аргентина были более богатыми и экономически успешными странами.',
        'h1' => 'Если бы Бразилия и Аргентина были богаче',
        'url' => 'https://shitik.com/ru/blog/rich-brazil-and-argentina',
        'preview' => 'https://shitik.com/images/blog/2023/rich-brazil-and-argentina/rich-brazil-and-argentina.jpg',
        'date' => [
            'htmlFormat' => '2023-08-05',
            'viewFormat' => '5 августа 2023',
        ],
        'titleForIndexBlog' => 'Если бы у Бразилии и Аргентины было больше денег',
        'descriptionForIndexBlog' => 'Те, кто давно увлекается футболом пережил самые разные тенденции вливания денег в футбол. Я начал увлекаться футболом в начале нулевых. Всегда самыми лучшими клубами мира являлись...',
        'status' => 1
    ],
    'ru/blog/immediate-reward' => [
        'title' => 'Общество с немедленным откликом и вознаграждением',
        'metaDescription' => 'Рассмотрим сравнение людей с немедленным и отложенным отклик о мами. Разберем почему в обществе многие живут с немедленным откликом',
        'h1' => 'Общество с немедленным вознаграждением',
        'url' => 'https://shitik.com/ru/blog/immediate-reward',
        'preview' => 'https://shitik.com/images/blog/2023/immediate-reward/immediate-reward.jpg',
        'date' => [
            'htmlFormat' => '2023-06-10',
            'viewFormat' => '10 июня 2023',
        ],
        'titleForIndexBlog' => 'Общество с немедленным вознаграждением',
        'descriptionForIndexBlog' => 'Не так давно я прочил книгу Джеймса Клира про то как привить хорошие привычки и избавиться от плохих. Не скажу, что это идеи основного посыла книги меня сильно впечатлили, но в целом...',
        'status' => 1
    ],
    'ru/blog/kidney-stone' => [
        'title' => 'Камень в почках.',
        'metaDescription' => 'История о том как у меня камень выходил из почки.',
        'h1' => 'Как у меня камень из почки выходил',
        'url' => 'https://shitik.com/ru/blog/kidney-stone',
        'preview' => 'https://shitik.com/images/blog/2023/kidney-stone/kidney-stone.jpg',
        'date' => [
            'htmlFormat' => '2023-06-03',
            'viewFormat' => '03 июня 2023',
        ],
        'titleForIndexBlog' => 'Как у меня камень из почки выходил',
        'descriptionForIndexBlog' => 'Несколько недель назад я проснулся в субботнее утром и практически сразу ощутил острую боль в районе живота. Наверняка каждый может представить...',
        'status' => 1
    ],
    'ru/blog/expensive-apartment-renovation' => [
        'title' => 'Ремонт квартиры за 50 000$. Результаты и описание.',
        'metaDescription' => 'Детальная статья с описанием ремонта моей двухкомнатной квартиры в Минске. Куда ушли 50 000$ и что было куплено на эту сумму в квартиру?',
        'h1' => 'Результаты ремонта квартиры',
        'url' => 'https://shitik.com/ru/blog/expensive-apartment-renovation',
        'preview' => 'https://shitik.com/images/blog/2023/expensive-apartment-renovation/expensive-apartment-renovation.jpg',
        'date' => [
            'htmlFormat' => '2023-04-08',
            'viewFormat' => '8 апреля 2023',
        ],
        'titleForIndexBlog' => 'Результаты ремонта квартиры',
        'descriptionForIndexBlog' => 'Продолжение статьи про выбор и покупку квартиры настало время написать детали по ремонту квартиры. Статья выходит более чем, через год после выхода прошлой, однако...',
        'status' => 1
    ],

    'ru/blog/scrum-and-sprint-life' => [
        'title' => 'Скрам в личной жизни',
        'metaDescription' => 'На протяжении последних 5-7 лет в поисках эффективного выполнения задач и целей используемые мной программы хранения заметок менялись уже несколько раз. В этой статье подробно разбираю как и почему я начал использовать Scrum в личной жизни.',
        'h1' => 'Жизнь по скраму со спринтами',
        'url' => 'https://shitik.com/ru/blog/scrum-and-sprint-life',
        'preview' => 'https://shitik.com/images/blog/2023/scrum-and-sprint-life/scrum-and-sprint-life.jpg',
        'date' => [
            'htmlFormat' => '2023-04-03',
            'viewFormat' => '3 апреля 2023',
        ],
        'titleForIndexBlog' => 'Жизнь по скраму со спринтами',
        'descriptionForIndexBlog' => 'На протяжении последних 7 лет я активно планирую различные долгосрочные цели 📝 на каждый год, а также последних лет 5 я активно планирую и расписываю краткосрочные задачи. За последнюю пятилетку мои инструменты претерпели немало изменений...',
        'status' => 1
    ],

    'ru/blog/monopolies' => [
        'title' => 'Монополия, а не конкуренция двигает прогрессом',
        'metaDescription' => 'Разбираю интересную точку зрения основателя PayPal Питера Тиля о том, что монополия лучше конкуренции.',
        'h1' => 'Монополия лучше конкуренции?',
        'url' => 'https://shitik.com/ru/blog/monopolies',
        'preview' => 'https://shitik.com/images/blog/2023/monopolies/monopolies.jpg',
        'date' => [
            'htmlFormat' => '2023-03-28',
            'viewFormat' => '28 марта 2023',
        ],
        'titleForIndexBlog' => 'Монополия лучше конкуренции?',
        'descriptionForIndexBlog' => 'Наверняка вы часто слышали, что именно конкуренция является двигателем прогресса. Всегда ли это утверждение верно? До недавнего времени я считал именно так. Но в книге одного из создателей PayPal...',
        'status' => 1
    ],

    'ru/blog/does-the-soul-exist' => [
        'title' => 'Существует ли душа человека?',
        'metaDescription' => 'Рассуждение на тему существования души с научной и логической точек зрения после того как я потерял одного из родственников.',
        'h1' => 'Существует ли душа?',
        'url' => 'https://shitik.com/ru/blog/does-the-soul-exist',
        'preview' => 'https://shitik.com/images/blog/2023/does-the-soul-exist/does-the-soul-exist.jpg',
        'date' => [
            'htmlFormat' => '2023-03-25',
            'viewFormat' => '25 марта 2023',
        ],
        'titleForIndexBlog' => 'Существует ли душа?',
        'descriptionForIndexBlog' => 'Пожалуй лучше бы этой статьи вообще не было. Не так давно у меня умер родственник и именно это печальное событие стало триггером для написания данной статьи. е так давно я смотрел видео о современных возможностях медицины и возвращении людей после остановки сердца...',
        'status' => 1
    ],

    'ru/blog/earth-overpopulation' => [
        'title' => 'Перенаселение Земли. Странности и краткие факты',
        'metaDescription' => 'Рассуждение о том, действительно ли планете грозит перенаселение, у каких стран большие проблемы и предположение что будет с населением Земли в будущем?',
        'h1' => 'Странности с перенаселением Земли',
        'url' => 'https://shitik.com/ru/blog/earth-overpopulation',
        'preview' => 'https://shitik.com/images/blog/2023/earth-overpopulation/earth-overpopulation.jpg',
        'date' => [
            'htmlFormat' => '2023-03-22',
            'viewFormat' => '22 марта 2023',
        ],
        'titleForIndexBlog' => 'Странности с перенаселением Земли',
        'descriptionForIndexBlog' => 'В этом посту я хочу затронуть тему перенаселения Земли. Несколько месяцев назад население нашей планеты перевалило за 8 миллиардов человек. Если добавить сюда все экологические проблемы и прогнозы с перенаселением Земли на ближайшие...',
        'status' => 1
    ],

    'ru/blog/car-in-winter' => [
        'title' => 'Почему автомобилисты не любят зиму - 21 причина',
        'metaDescription' => 'Подробное описание распространенных проблем, которые могут случиться зимой с вашем авто',
        'h1' => 'Почему водители не любят зиму?',
        'url' => 'https://shitik.com/ru/blog/car-in-winter',
        'preview' => 'https://shitik.com/images/blog/2023/car-in-winter/car-in-winter.jpg',
        'date' => [
            'htmlFormat' => '2023-02-12',
            'viewFormat' => '12 февраля 2023',
        ],
        'titleForIndexBlog' => 'Почему водители не любят зиму?',
        'descriptionForIndexBlog' => 'Зима чудесное время года. Кругом лежит белый снег, на окнах мороз, и ты можешь идти по улице и наслаждаться красивыми пейзажами природы в ожидании Нового Года...',
        'status' => 1
    ],

    'ru/blog/total-2022' => [
        'title' => 'Итоги моего 2022 года',
        'metaDescription' => 'Подвел итоги уходящего года. Интересные факты 2022 года',
        'h1' => 'Чем я занимался в 2022 году',
        'url' => 'https://shitik.com/ru/blog/total-2022',
        'preview' => 'https://shitik.com/images/blog/2023/total-2022/total-2022.jpg',
        'date' => [
            'htmlFormat' => '2023-01-06',
            'viewFormat' => '6 января 2023',
        ],
        'titleForIndexBlog' => 'Итоги моего 2022 года',
        'descriptionForIndexBlog' => '2022 прошел, а значит пора подводить итоги года. Как и несколько предыдущих лет я досконально документирую многие вещи. Мой слоган года был не самый приятный...',
        'status' => 1
    ],
];