<?php

return [
    'ru/blog/my-first-book' => [
        'title' => 'Как я написал свою первую книгу «Как гуманитарию подчинить продуктивность и планирование?»',
        'metaDescription' => 'Описание моей первой книги о продуктивности, времени, планировании и поставке целей и задач.',
        'h1' => 'Моя первая книга',
        'url' => 'https://shitik.com/ru/blog/my-first-book',
        'preview' => 'https://shitik.com/images/blog/2025/my-first-book/my-first-book.jpg',
        'date' => [
            'htmlFormat' => '2025-01-05',
            'viewFormat' => '05 января 2024',
        ],
        'titleForIndexBlog' => 'Моя первая книга',
        'descriptionForIndexBlog' => 'На протяжении всего 2024 года и даже чуть больше я работал над своей первой книгой. В самом конце года она наконец-то вышла. Сейчас настало время рассказать, о чем эта книга, чем она лучше других, кому подойдет, а также описать весь путь, который мне пришлось пройти за время ее написания...',
        'status' => 1
    ],

];