<?php
includeCSS(['modules/general', 'modules/fonts', 'modules/header', 'modules/breadcrumb', 'modules/content', 'about']);
include DOCUMENT_ROOT . '/view/v3/head.php';
?>
<body>
<?php include DOCUMENT_ROOT . '/view/v3/menu.php'; ?>

<main class="container">
    <ul class="breadcrumb">
        <li><a href="/hi">मुख्य पृष्ठ</a></li>
        <li class="active">Shitik Alexander Andreevich</li>
    </ul>

    <div class="content">
        <h1>Shitik Alexander Andreevich</h1>
        <h2>सामान्य जानकारी</h2>
        <img width="500" height="634" class="about-photo" src="/themes/v3/images/about/photo.jpg" alt="Шитик Александр Андреевич" loading="lazy">
        <p>सभी को नमस्कार। मैं shitik.com साइट का लेखक और निर्माता हूँ। कभी यह साइट मेरी पोर्टफोलियो और परियोजना थी, जहाँ मैं अपनी सोच साझा करता था। किताबें पढ़ने, फिल्में देखने और विज्ञान का अध्ययन करने के साथ मेरी सोच इतनी बढ़ गई कि मैंने साइट के अतिरिक्त अनुभाग बनाने का निर्णय लिया और दूसरों को ज्ञान साझा करना शुरू किया।
            और यही मैं बहुत जल्द करने वाला हूँ। इस साइट पर आप मेरी व्यक्तिगत किताबें, यात्रा की तस्वीरें और बहुत कुछ पा सकते हैं।</p>

        <div style="clear: both"></div>

        <h2>शिक्षा</h2>
        <p><b>Orsha College "Vitebsk State University named after P.M. Masherov"</b><br>
            <span>अवधि:</span> 2009-2013<br>
            <span>विशेषज्ञता:</span> सूचना प्रौद्योगिकी का सॉफ़्टवेयर<br>
            <span>पदवी:</span> तकनीकी प्रोग्रामर
        </p>
        <p><b>Belarusian State University of Informatics and Radioelectronics (BSUIR)</b><br>
            <span>अवधि:</span> 2013-2017<br>
            <span>विशेषज्ञता:</span> सूचना प्रौद्योगिकी का सॉफ़्टवेयर<br>
            <span>पदवी:</span> इंजीनियर-प्रोग्रामर
        </p>


        <h2>मेरे शौक और रुचियाँ</h2>
        <ul>
            <li><a href="#programming">प्रोग्रामिंग करता हूँ</a></li>
            <li><a href="#travel">यात्रा करता हूँ</a></li>
            <li><a href="#run">सड़क पर 10-14 किमी दौड़ता हूँ (यहाँ तक कि सर्दियों में भी)</a></li>
            <li><a href="#football">2003 से फुटबॉल खेलता हूँ और देखता हूँ</a></li>
            <li><a href="#collection">मुझे चीजें इकट्ठा करने (कलेक्शन) का शौक है</a></li>
            <li><a href="#books">किताबें पढ़ना नापसंद है, लेकिन पिछले कुछ सालों में 150 से अधिक किताबें पढ़ी हैं</a></li>
            <li><a href="#productivity">मैं योजना बनाने और उत्पादकता बढ़ाने पर ध्यान देता हूँ। मैंने 2 किताबें लिखी हैंं</a></li>
            <li><a href="#space">एस्ट्रोफिजिक्स और ब्रह्मांड से प्यार है। विज्ञान का प्रचार करता हूँ और पseudoscience को नापसंद करता हूँ</a></li>
            <li><a href="#blog">कई विभिन्न विषयों पर लेख लिखता हूँ</a></li>
            <li><a href="#movie">सिनेमाई ज्ञान में अच्छा हूँ</a></li>
            <li><a href="#music">रॉक संगीत सुनता हूँ</a></li>
            <li>पहले WWE देखा करता था।</li>
        </ul>


        <h2 id="programming">प्रोग्रामिंग</h2>
        <p>मैं पेशेवर रूप से एक प्रोग्रामर हूँ, और यह मेरे जीवन शैली और तरीके का हिस्सा है। वर्तमान में, मैं वित्तीय और व्यापार परियोजनाओं के लिए सॉफ़्टवेयर विकास के क्षेत्र में काम कर रहा हूँ।
            मैं अपनी वर्तमान नौकरी में 7 से अधिक वर्षों से काम कर रहा हूँ और एक साधारण कर्मचारी से कंपनी के CTO तक पहुँच चुका हूँ।</p>
        <p>2012 से 2014 के बीच, मैंने Windows OS के लिए डेस्कटॉप प्रोग्रामिंग की।<br>
            2014 के बाद से, मैंने मुख्य रूप से वेब विकास में काम करना शुरू किया। 2014 से 2017 तक, मैं मिन्स्क की एक वेब स्टूडियो में काम कर रहा था और सौ से अधिक परियोजनाओं में भाग लिया, इसलिए 2017 के बाद मैंने अपनी छोटी और मध्यम परियोजनाओं को गिनना छोड़ दिया।<br>
            2017 से, मैंने एक वित्तीय-आर्थिक वेबसाइट पर काम करना शुरू किया, जो अब एक बड़ा प्रोजेक्ट बन चुका है, और मैं एक साधारण मिडल प्रोग्रामर से कंपनी के प्रमुख प्रोग्रामर तक पहुँच चुका हूँ। इसके अलावा, इस क्षेत्र में और भी कई बड़े और दिलचस्प प्रोजेक्ट जुड़े हैं।</p>
        <p>कॉलेज के समय, मैंने असेंबलर, Visual Basic, Pascal, C, C++, C#, Delphi, JavaScript, PHP जैसे भाषाओं का प्रयास किया। अधिकतर परियोजनाएं मैंने Delphi में लिखी और साथ ही PHP का सक्रिय रूप से अध्ययन किया।</p>
        <p>विश्वविद्यालय के दौरान, मैंने Java से परिचित हुआ और Delphi से अपना ध्यान C++ Builder की ओर बढ़ा लिया। मैंने अपनी सिद्धांतात्मक और व्यावहारिक क्षमताओं को सुधारने के लिए YouTube पर ढेर सारे वीडियो देखे। इस समय के दौरान, मैंने वेब में सक्रिय रूप से काम करना शुरू किया और बैक-एंड और फ्रंट-एंड विकास दोनों में अनुभव प्राप्त किया।</p>
        <p>मैंने प्रोग्रामिंग भाषाओं, तकनीकों, डेटाबेस, अवधारणाओं और दृष्टिकोणों पर दर्जनों किताबें पढ़ी हैं।
            2021 से, मैं हर हफ्ते <a href="/hi/blog/podcasts" target="_blank">पॉडकास्ट</a> सुनता हूँ और लेख पढ़ता हूँ, ताकि मैं IT की नवीनतम घटनाओं और समाचारों से अवगत रह सकूँ। मेरे कार्य में परियोजनाओं की विशिष्टता के कारण, मुझे तकनीकी SEO के बारे में भी अच्छी जानकारी है।</p>

        <h2 id="travel">यात्राएँ</h2>
        <p>मैंने 2019 से ही सक्रिय रूप से यात्रा करना शुरू किया। वर्तमान में, मैंने 12 देशों का दौरा किया है। कुछ यात्राओं पर मेरे ब्लॉग में विस्तृत लेख हैं।
            उदाहरण के लिए, मेरी यात्रा के बारे में विस्तृत लेख हैं <a href="/hi/blog/trip-to-azerbaijan" target="_blank">आज़रबेज़ान</a> और <a href="/hi/blog/trip-to-georgia" target="_blank">जॉर्जिया</a> के बारे में, साथ ही एक लेख है मेरी यात्रा के बारे में <a href="/hi/blog/trip-to-bali" target="_blank">बाली</a> जाने की, जिसमें मैंने चीन के माध्यम से यात्रा की थी।
            मैं साइट पर यात्रा अनुभाग को अपडेट करने की योजना बना रहा हूँ और अधिक पोस्ट करने का इरादा है, लेकिन इस समय यात्रा के परिणामों को प्रकाशित करने का सबसे सक्रिय तरीका मेरा <a rel="noopener" href="https://www.instagram.com/shitik.sasha" target="_blank">इंस्टाग्राम खाता</a> है।</p>

        <h2 id="run">दौड़ना</h2>
        <p>मैंने पहले से ही 8 साल से अधिक समय तक बाहर दौड़ने की गतिविधि की है और इस दौरान कुल मिलाकर 1500 किलोमीटर से अधिक दौड़ा हूँ। 200 से अधिक दौड़, चाहे गर्मी हो या सर्दी। मेरे <a href="/hi/blog" target="_blank">ब्लॉग</a> में दौड़ के बारे में नियमित रूप से पोस्ट होते रहते हैं।<br>
            <a href="/hi/blog/run-2024">2024 में दौड़ का परिणाम</a><br>
            <a href="/hi/blog/run-2023">2023 में दौड़ का आंकड़ा</a><br>
            <a href="/hi/blog/run-2022">2022 में दौड़ के परिणाम</a><br>
            <a href="/hi/blog/run-2021" target="_blank">2021 में दौड़ के परिणाम</a><br>
            <a href="/hi/blog/run-2018-2020" target="_blank">मेरी दौड़ का आंकड़ा 2.5 वर्षों में</a><br>
            <a href="/hi/blog/run" target="_blank">नई व्यक्तिगत दौड़ रिकॉर्ड</a>
        </p>

        <h2 id="football">फुटबॉल</h2>
        <p>“एक बार जब यह आपके रक्त में समा जाए, तो 'मिलान' हमेशा के लिए आपकी नसों में बस जाता है।” – रुई कोस्टा। यही मेरे साथ 2002-2003 में हुआ था, जब मिलान ने चैंपियंस लीग जीत ली थी। तभी से मैं न केवल फुटबॉल देखता हूं, बल्कि इसमें सक्रिय रूप से खेलता भी हूं। हालांकि, पिछले कुछ वर्षों से समय की कमी के कारण मेरा फुटबॉल से संबंध केवल मैचों को देखने तक सीमित है, और खेलों में भाग नहीं ले पाता।</p>

        <h2 id="collection">मुझे चीजें इकट्ठा करने (कलेक्शन) का शौक है</h2>
        <p>बचपन में मैंने लगभग हजार Pokémon के फिच्के, कुछ पुराने सिक्के और मोनिटियां इकट्ठा की थीं, जिनकी संख्या मुझे अब ठीक से याद नहीं है, साथ ही फुटबॉल के पोस्टर और पत्रिकाओं से कुछ सौ फुटबॉल पोस्टर भी जोड़े थे। वैसे, फुटबॉल पत्रिकाएँ और अखबार हाल तक भी संचित किए जाते थे, और उनकी संख्या भी कुछ सौ थी। बचपन में इंटरनेट न होने के कारण पत्रिकाएँ और टेलीविजन ही फुटबॉल के बारे में जानकारी प्राप्त करने के एकमात्र स्रोत थे।</p>
        <p>वर्तमान में, मेरी संग्रहणों में दो प्रकार की वस्तुएं शामिल हैं: बॉलपेन और पजल। और पजल आम तौर पर 1000 टुकड़ों वाले बड़े आकार के होते हैं।</p>

        <h2 id="books">पुस्तकें</h2>
        <p>ऐसा हुआ कि मैं बहुत सारी किताबें पढ़ता हूँ। आधी किताबें प्रौद्योगिकियों और प्रोग्रामिंग भाषाओं के बारे में हैं। IT क्षेत्र बहुत विशाल और तेजी से विकसित हो रहा है, इसलिए मुझे हमेशा कुछ नया सीखने की आवश्यकता होती है। दूसरी आधी किताबें विभिन्न प्रकार के विषयों पर होती हैं: आत्मविकास, मनोविज्ञान, स्वास्थ्य, योजना, वित्तीय समृद्धि और अन्य शैलियाँ।</p>
        <p>हर साल मैं <a href="/hi/blog" target="_blank">ब्लॉग</a> में एक छोटी सी लेख के रूप में अपनी पढ़ी गई किताबों का रिपोर्ट लिखता हूँ।<br>
            <a href="/hi/blog/books-2024" target="_blank">2024 में पढ़ी गई किताबों के परिणाम</a><br>
            <a href="/hi/blog/books-2023" target="_blank">2023 की किताबों की सांख्यिकी</a><br>
            <a href="/hi/blog/books-2022" target="_blank">2022 में पढ़ी गई किताबें</a><br>
            <a href="/hi/blog/books-2021" target="_blank">2021 में पढ़ी गई किताबें</a><br>
            <a href="/hi/blog/books-2020" target="_blank">11 महीनों में तीसरी सदी की किताबें</a>
        </p>
        <p>इसके अलावा, जल्द ही मैं अपनी वेबसाइट पर एक पूर्ण खंड बनाने की योजना बना रहा हूँ, जिसमें मैं किताबों का विश्लेषण प्रकाशित करूंगा। अभी तक, मेरी सभी किताबों की टिप्पणियाँ मेरे Instagram अकाउंट पर प्रकाशित की गई हैं, जो किताबों पर आधारित है।</p>

        <h2 id="productivity">उत्पादकता और योजना</h2>
        <p>पिछले 5 वर्षों से मैं अपनी व्यक्तिगत जिंदगी में परियोजना-आधारित दृष्टिकोण का सक्रिय रूप से पालन कर रहा हूँ, और यह मुझे निर्धारित लक्ष्यों को प्राप्त करने में मदद करता है। मैं वास्तव में मानता हूँ कि मुझे इस क्षेत्र में अच्छा ज्ञान है, क्योंकि मैंने इस विषय पर दर्जनों किताबें पढ़ी हैं।
            परिणामस्वरूप, मैंने लेख लिखे हैं <a href="/hi/blog/planning" target="_blank">«लक्ष्यों की प्राप्ति के स्तर के रूप में योजना»</a> और <a href="/hi/blog/scrum-and-sprint-life" target="_blank">«स्क्रम और स्प्रिंट्स के साथ जीवन»</a>, और साथ ही अपनी उत्पादकता पर किताब <a href="/hi/blog/my-first-book" target="_blank">«कैसे एक मानविकी छात्र को उत्पादकता और योजना के अधीन करें?»</a> लिखी है, और वर्तमान में मैं दूसरी लिख रहा हूँ।</p>
        <p>जल्द ही मैं अपनी वेबसाइट पर किताबों के लिए एक खंड बनाने की योजना बना रहा हूँ और उन्हें अपनी वेबसाइट पर प्रकाशित करूंगा।</p>

        <h2 id="space">अंतरिक्ष और विज्ञान</h2>
        <p>स्कूल के समय से ही मैं विज्ञान और ब्रह्मांडशास्त्र में रुचि रखने लगा था। मैंने कभी इसे पेशेवर स्तर पर नहीं किया, लेकिन पिछले 15-20 वर्षों से ब्रह्मांड में मेरी रुचि इतनी बढ़ी कि अब मैं उन सामान्य लोगों से दो-तीन कदम आगे हूं, जिन्हें इस दिशा में हो रही प्रगति और वर्तमान में टेक्नोलॉजी के कितने कदम आगे बढ़ने का कोई अंदाजा नहीं है।
            इसलिए मैं अंतरिक्ष और विज्ञान पर लेख प्रकाशित करने की योजना बना रहा हूं, जिसमें मैं जटिल चीजों को सरल और रोचक तरीके से समझाऊंगा। जल्द ही इस पर एक अलग खंड वेबसाइट पर उपलब्ध होगा।
            अगर फुटबॉल और खेलों में या किसी अन्य क्षेत्र में मेरे कोई आदर्श नहीं हैं, तो विज्ञान में शायद यह स्टीफन हॉकिंग हैं। एक अच्छा आधुनिक वैज्ञानिक और विज्ञान का लोकप्रियक, जिन्होंने अपनी कठिनाइयों के बावजूद जीवन के प्रति अपने प्यार का वास्तविक उदाहरण पेश किया।</p>

        <h2 id="blog">ब्लॉग</h2>
        <p>मैंने अपना <a href="/hi/blog" target="_blank">ब्लॉग</a> करीब 10 साल पहले शुरू किया था, और शुरुआत में उसमें प्रोग्रामिंग से संबंधित पोस्ट्स आती थीं। हालांकि, विकास क्षेत्र बहुत तेजी से बदलता है, जिससे लेख जल्दी ही अप्रचलित हो जाते थे। साथ ही, इस दौरान मैंने किताबें पढ़नी शुरू की, योजना बनाने में रुचि ली, और अंतरिक्ष और विज्ञान को और गहराई से अध्ययन किया। इसलिए तब से मेरे ब्लॉग का विषय बदल गया, और पोस्ट्स अधिक दिलचस्प हो गईं। अब ब्लॉग में प्रोग्रामिंग पर कोई पोस्ट नहीं है।</p>

        <h2 id="movie">सिनेमाघर और फिल्में</h2>
        <p>2020 से मैंने <a href="/hi/blog/movies-imdb" target="_blank">IMDb द्वारा शीर्ष 250 फिल्मों</a> को देखना शुरू किया। यह मुझे इतना पसंद आया कि मैंने <a href="/hi/blog/kinopoisk-250" target="_blank">KinoPoisk द्वारा शीर्ष 250 फिल्मों</a> को भी देखना शुरू कर दिया। IMDb और KinoPoisk के लिए, फिल्में देखने के बाद मैंने अलग-अलग लेख लिखे, जहां मैंने कई फिल्मों की विस्तृत समीक्षा की। सामान्य देखने के अलावा, मैंने फिल्में देखीं और उन पर रिव्यू भी पढ़े, जिससे मुझे निर्देशक की मंशा और संदेश को बेहतर समझने में मदद मिली। पिछले कुछ सालों से, मैं अक्सर प्रीमियर फिल्मों को देखने सिनेमाघरों में जाता हूँ। आने वाले समय में, मैं इसके लिए वेबसाइट पर एक अलग खंड शुरू करने की योजना बना रहा हूँ और नए और यहां तक कि पुराने फिल्मों की समीक्षाएं लिखने की सोच रहा हूँ।</p>

        <h2 id="music">संगीत</h2>
        <p>अब तक मैंने अपने क़ुमीरों में सिर्फ हॉकिन्स का ज़िक्र किया था, लेकिन एक और है, जो संगीत के क्षेत्र से ताल्लुक रखता है। वह भी एक ऐसा व्यक्ति था, जो अपने लक्ष्यों की ओर पूरी मेहनत से बढ़ता गया और अपनी आखिरी सांस तक अपने लक्ष्य के लिए काम करता रहा। वह व्यक्ति है - फ़्रेडी मर्क्यूरी। मेरे लिए क्वीन के गाने अनमोल हैं, और मर्क्यूरी की आवाज़ के जितना करीब कोई पहुँच सकता है, वह शायद क्लॉस माइने ही हैं। तो, जैसा कि आप समझ ही गए होंगे, मुझे रॉक म्यूजिक बहुत पसंद है, खासकर विदेशी रॉक, और विशेष रूप से 80 के दशक का संगीत। हालांकि, मैं समकालीन और घरेलू रॉक को भी उतना ही आनंद से सुनता हूँ।</p>

        <h2 class="text-center title">प्रतिक्रिया</h2>
        <p>आप मुझसे व्यक्तिगत रूप से संपर्क कर सकते हैं।</p>
        <ul>
            <li><a rel="noopener" href="https://www.instagram.com/shitik.sasha" target="_blank">Instagram</a></li>
            <li><a rel="noopener" href="https://t.me/sasha_shitik" target="_blank">Telegram</a></li>
        </ul>
        <p>आप मेरे पब्लिक्स को भी फॉलो कर सकते हैं, ताकि आप नई खबरों और लेखों की पोस्ट्स से वंचित न हों:</p>
        <ul>
            <li><a rel="noopener" href="https://www.facebook.com/groups/1634020277998483" target="_blank">Facebook</a></li>
            <li><a rel="noopener" href="https://www.whatsapp.com/channel/0029VbBOueF2Jl8BBbawQS15" target="_blank">WhatsApp</a></li>
            <li><a rel="noopener" href="https://t.me/shitikcom" target="_blank">Telegram</a></li>
        </ul>

    </div>
</main>
<?php include DOCUMENT_ROOT . '/view/v3/footer.php'; ?>
<?php include DOCUMENT_ROOT . '/view/v3/js-scripts.php'; ?>
</body>
</html>