<?php

return [
    'ru/blog/books-2020' => [
        'title' => 'Впечатления после того как прочил 32 книги за 11 месяцев 2020 года.',
        'metaDescription' => 'Решил поделиться впечатлениями после того как прочил 32 книги за 11 месяцев 2020 года.',
        'h1' => 'Треть сотни книг за 11 месяцев',
        'url' => 'https://shitik.com/ru/blog/books-2020',
        'preview' => 'https://shitik.com/images/blog/2020/books/books.jpg',
        'date' => [
            'htmlFormat' => '2020-12-05',
            'viewFormat' => '5 декабря 2020',
        ],
        'titleForIndexBlog' => 'Треть сотни книг за 11 месяцев',
        'descriptionForIndexBlog' => 'Объявляя личным год 2020 годом “чтения книг” я не ставил перед собой определенные цели по количеству книг. Я хотел еще дальше прокачать свои скиллы по программированию, ведь среди множества направлений...',
        'status' => 1
    ],

    'ru/blog/planning' => [
        'title' => 'Планирование как степень достижения целей',
        'metaDescription' => 'Коротко о том как я планирую. Заметки, карты анти-деградации, разбиение по типам целей и многое другое',
        'h1' => 'Планирование как степень достижения целей',
        'url' => 'https://shitik.com/ru/blog/planning',
        'preview' => 'https://shitik.com/images/blog/2020/planning/planning.jpg',
        'date' => [
            'htmlFormat' => '2020-08-03',
            'viewFormat' => '3 августа 2020',
        ],
        'titleForIndexBlog' => 'Планирование как степень достижения целей',
        'descriptionForIndexBlog' => 'Ложась в постель перед сном как часто Вы задаете себе вопросы: "На сколько сегодняшний день отличается от остальных?” И "что полезного я сделал сегодня для достижения целей?”...',
        'status' => 1
    ],

    'ru/blog/koronavirus' => [
        'title' => 'Немного мыслей вслух про коронавирус',
        'metaDescription' => 'Попытаюсь описать реальную картину на сегоняшний день своими глазами',
        'h1' => 'Мои мысли о коронавирусе',
        'url' => 'https://shitik.com/ru/blog/koronavirus',
        'preview' => 'https://shitik.com/images/blog/2020/koronavirus/koronavirus.jpg',
        'date' => [
            'htmlFormat' => '2020-03-12',
            'viewFormat' => '12 марта 2020',
        ],
        'titleForIndexBlog' => 'Мои мысли о коронавирусе',
        'descriptionForIndexBlog' => 'Еще пару недель назад ситуация с коронавирусом была действительно непонятной. Многое зависело от того как развитые страны Европы, США и другие будут готовые встретить коронавирус ибо на примере одного Китая понять это было невозможно...',
        'status' => 1
    ],
];
