<?php

return [
    // 2021
    'ru/blog/total-2021' => [
        'title' => 'Итоги моего 2021 года',
        'metaDescription' => 'Подвел итоги уходящего года. Интересные факты уходящего года',
        'h1' => 'Чем я занимался в 2021 году',
        'url' => 'https://shitik.com/ru/blog/total-2021',
        'preview' => 'https://shitik.com/images/blog/2021/total-2021/total-2021.jpg',
        'date' => [
            'htmlFormat' => '2021-12-21',
            'viewFormat' => '29 декабря 2021',
        ],
        'titleForIndexBlog' => 'Итоги моего 2021 года',
        'descriptionForIndexBlog' => 'Конец декабря. Самое время подвести итоги уходящего года и так как я до мозга костей технарь многие цели и просто показатели я документировал...',
        'status' => 1
    ],

    'ru/blog/run-2021' => [
        'title' => 'Итоги бега за 2021 год',
        'metaDescription' => 'Результаты бега за текущий год. Сравнение показателей с предыдущими годами',
        'h1' => 'Результаты бега за 2021',
        'url' => 'https://shitik.com/ru/blog/run-2021',
        'preview' => 'https://shitik.com/images/blog/2021/run-2021/run-2021.jpg',
        'date' => [
            'htmlFormat' => '2021-12-21',
            'viewFormat' => '21 декабря 2021',
        ],
        'titleForIndexBlog' => 'Результаты бега за 2021',
        'descriptionForIndexBlog' => 'Этот год был весьма успешным в плане бега, я на своем организме прочувствовал как прибавил почти во всех показателях. Рассмотрим ниже все пробежки...',
        'status' => 1
    ],

    'ru/blog/kinopoisk-250' => [
        'title' => 'Пересмотрел топ 250 на кинопоиске',
        'metaDescription' => 'Впечатления от просмотра топ 250 фильмов по версии кинопоиска.',
        'h1' => 'Мысли после просмотра 250 лучших фильмов кинопоиска',
        'url' => 'https://shitik.com/ru/blog/kinopoisk-250',
        'preview' => 'https://shitik.com/images/blog/2021/kinopoisk-250/kinopoisk-250.jpg',
        'date' => [
            'htmlFormat' => '2021-12-18',
            'viewFormat' => '18 декабря 2021',
        ],
        'titleForIndexBlog' => 'Мысли после просмотра 250 лучших фильмов кинопоиска',
        'descriptionForIndexBlog' => 'По мнению друзей статья про фильмы IMDb написанная в прошлом году была одной из моих лучших. Там я описал свои впечатления от просмотра культовых фильмов всех времен...',
        'status' => 1
    ],

    'ru/blog/books-2021' => [
        'title' => 'Еще 30 книг за 11 месяцев',
        'metaDescription' => 'Список книг, которые успел прочитать за 11 месяцев 2021 года.',
        'h1' => 'Прочитанные книги в 2021 году',
        'url' => 'https://shitik.com/ru/blog/books-2021',
        'preview' => 'https://shitik.com/images/blog/2021/books-2021/books-2021.jpg',
        'date' => [
            'htmlFormat' => '2021-12-05',
            'viewFormat' => '05 декабря 2021',
        ],
        'titleForIndexBlog' => 'Прочитанные книги в 2021 году',
        'descriptionForIndexBlog' => 'В текущем году я прочитал 30 книг, что на 2 меньше чем в прошлом году. Думаю это было связано с путешествием в Новосибирск и Алтай, плюс сказалась покупка квартиры и последующий...',
        'status' => 1
    ],

    'ru/blog/run-2018-2020' => [
        'title' => 'Статистика моего бега за 2018-2020',
        'metaDescription' => 'Статистика моего бега за вторую половину 2018 года, а также за 2019 и 2020 года.',
        'h1' => 'Статистика моего бега за 2.5 года',
        'url' => 'https://shitik.com/ru/blog/run-2018-2020',
        'preview' => 'https://shitik.com/images/blog/2021/run-2018-2020/run-2018-2020.jpg',
        'date' => [
            'htmlFormat' => '2021-12-04',
            'viewFormat' => '04 декабря 2021',
        ],
        'titleForIndexBlog' => 'Статистика моего бега за 2.5 года',
        'descriptionForIndexBlog' => 'После активного спортивного детства и подросткового возраста я закинул спорт буквально на 4-5 лет после чего мое здоровье слегка ухудшилось. Врачи даже поставили мне тахикардию (учащенное сердцебиение), но я не стал...',
        'status' => 1
    ],

    'ru/blog/people-without-food' => [
        'title' => 'Рассуждение как изменилась бы человество, если бы мы не нуждались в еде',
        'metaDescription' => 'Человеческий цивилизация слишкам слаба и зависима от разных факторов: наличие кислород в нужной объеме, подходящие давление и температура, защита от радиации',
        'h1' => 'Если бы люди не нуждались в еде',
        'url' => 'https://shitik.com/ru/blog/people-without-food',
        'preview' => 'https://shitik.com/images/blog/2021/people-without-food//people-without-food.jpg',
        'date' => [
            'htmlFormat' => '2021-10-30',
            'viewFormat' => '30 октября 2021',
        ],
        'titleForIndexBlog' => 'Если бы люди не нуждались в еде',
        'descriptionForIndexBlog' => 'Человеческий цивилизация слишком слаба и зависима от разных факторов: наличие кислород в нужной объеме, подходящие давление и температура, защита от радиации, постоянная нужда в питье и еде...',
        'status' => 1
    ],

    'ru/blog/seats-in-the-trolleybus' => [
        'title' => 'Что не так с количеством мест для инвалидов в троллейбусе',
        'metaDescription' => 'По Минску работают очень много троллейбусов модели АКСМ-321. Замечали ли вы соотношение мест для инвалидов по отношению к обычным в данной модели троллейбуса?',
        'h1' => 'Места для инвалидов в троллейбусе',
        'url' => 'https://shitik.com/ru/blog/seats-in-the-trolleybus',
        'preview' => 'https://shitik.com/images/blog/2021/seats-in-the-trolleybus/seats-in-the-trolleybus.jpg',
        'date' => [
            'htmlFormat' => '2021-10-30',
            'viewFormat' => '30 октября 2021',
        ],
        'titleForIndexBlog' => 'Что не так с количеством инвалидных мест в троллейбусе',
        'descriptionForIndexBlog' => 'По Минску работают очень много троллейбусов модели АКСМ-321. Не скажу что каждый день, но достаточно часто и ими пользуюсь для перемещения по городу...',
        'status' => 1
    ],

    'ru/blog/new-super-heroes' => [
        'title' => 'Новые супер герои. Наш ответ Marvel и DC',
        'metaDescription' => 'Наверняка почти каждый из вас видел хотя бы один из кучи фильмов студий Marvel и DC, где в каждой из них они спасают планету от внутренних и внешних угроз',
        'h1' => 'Наш ответ Marvel и DC',
        'url' => 'https://shitik.com/ru/blog/new-super-heroes',
        'preview' => 'https://shitik.com/images/blog/2021/new-super-heroes/new-super-heroes.jpg',
        'date' => [
            'htmlFormat' => '2021-10-24',
            'viewFormat' => '24 октября 2021',
        ],
        'titleForIndexBlog' => 'Наш ответ Marvel и DC',
        'descriptionForIndexBlog' => 'Согласно древне вавилонским мудростям на глиняных дощечках, которые легли в основу хорошей книги “Самый богатый человек в Вавилоне” одна из них гласит, что любой человек...',
        'status' => 1
    ],

    'ru/blog/home-bay' => [
        'title' => 'За 2 года я насобирал на свою первую квартиру в Минске',
        'metaDescription' => 'Согласно древне вавилонским мудростям на глиняных дощечках, которые легли в основу хорошей книги “Самый богатый человек в Вавилоне” одна из них гласит, что любой человек должен обзавестись собственных жильем.',
        'h1' => 'Первая квартира',
        'url' => 'https://shitik.com/ru/blog/home-bay',
        'preview' => 'https://shitik.com/images/blog/2021/home-bay/home-bay.jpg',
        'date' => [
            'htmlFormat' => '2021-10-17',
            'viewFormat' => '17 октября 2021',
        ],
        'titleForIndexBlog' => 'Моя первая квартира',
        'descriptionForIndexBlog' => 'Согласно древне вавилонским мудростям на глиняных дощечках, которые легли в основу хорошей книги “Самый богатый человек в Вавилоне” одна из них гласит, что любой человек...',
        'status' => 1
    ],

    'ru/blog/site-update' => [
        'title' => 'Обновил и доработал свой сайт',
        'metaDescription' => 'Не так давно я обновил свой сайт. Теперь все его разделы снова в одном месте. Среди основных изменяй можно выделить слегка измененный дизайн, расширения сайта и внедрением новых разделов.',
        'h1' => 'Обновление сайта',
        'url' => 'https://shitik.com/ru/blog/site-update',
        'preview' => 'https://shitik.com/images/blog/2021/site-update/site-update.jpg',
        'date' => [
            'htmlFormat' => '2021-09-12',
            'viewFormat' => '12 сентября 2021',
        ],
        'titleForIndexBlog' => 'Обновил и доработал свой сайт',
        'descriptionForIndexBlog' => 'Не так давно я обновил свой сайт. Теперь все его разделы снова в одном месте, однако это технические детали, которые вряд ли кому-то интересны. Так же среди основных изменяй можно выделить слегка измененный дизайн...',
        'status' => 1
    ],

    'ru/blog/black-lines' => [
        'title' => 'Что я извлек из черной полосы в жизни',
        'metaDescription' => 'Не так давно в моей жизни случился отрезов длинною в 1-2 месяца в котором я сталкнулся с целым рядом проблем.',
        'h1' => 'Моя черная полоса',
        'url' => 'https://shitik.com/ru/blog/black-lines',
        'preview' => 'https://shitik.com/images/blog/2021/black-lines/black-lines.jpg',
        'date' => [
            'htmlFormat' => '2021-08-17',
            'viewFormat' => '17 августа 2021',
        ],
        'titleForIndexBlog' => 'Моя черная полоса',
        'descriptionForIndexBlog' => 'В каком возрасте вы впервые столкнулись с черными полосами в своей жизни? До недавнего времени я не верил в их существование, наверно потому даже живя один и решая самостоятельно свои проблемы они не приходили ко мне...',
        'status' => 1
    ],
    'ru/blog/run' => [
        'title' => 'Избавился от тахикардии и бегаю по 15-16 километров',
        'metaDescription' => 'Мысли и впечатления о том, как я вернул спортивный образ жизни после 3-4 летнего перерыва.',
        'h1' => 'Новый личный беговой рекорд',
        'url' => 'https://shitik.com/ru/blog/run',
        'preview' => 'https://shitik.com/images/blog/2021/running-record/run.jpg',
        'date' => [
            'htmlFormat' => '2021-04-28',
            'viewFormat' => '28 апреля 2021',
        ],
        'titleForIndexBlog' => 'Новый личный беговой рекорд',
        'descriptionForIndexBlog' => 'Сегодня я установил личный рекорд по бегу. 16 километров 200 метров без единой остановки. Вся эта дистанция далась мне ровно за....<br>Обновлено 18 км 200 метров.',
        'status' => 1
    ],

    'ru/blog/movies-imdb' => [
        'title' => 'Пересмотрел всю классику мирового кино',
        'metaDescription' => 'Решил поделиться впечатлениями как я пересмотрел всю классику мирового кино от Чаплина до Нолана.',
        'h1' => 'Мысли после просмотра 250 лучших фильмов всех времен',
        'url' => 'https://shitik.com/ru/blog/movies-imdb',
        'preview' => 'https://shitik.com/images/blog/2021/movies-imdb/movies-imdb.jpg',
        'date' => [
            'htmlFormat' => '2021-03-22',
            'viewFormat' => '22 марта 2021',
        ],
        'titleForIndexBlog' => 'Мысли после просмотра 250 лучших фильмов всех времен',
        'descriptionForIndexBlog' => 'Меня всегда слегка пугали люди, которые в stories или других источниках просят друзей и знакомых посоветовать фильм ибо сами не могут его выбрать....',
        'status' => 1
    ],

    'ru/blog/podcasts' => [
        'title' => 'Обучение через подкасты',
        'metaDescription' => 'Как я отбирал новые подкасты для изучения',
        'h1' => 'Обучение через подкасты',
        'url' => 'https://shitik.com/ru/blog/podcasts',
        'preview' => 'https://shitik.com/images/blog/2021/podcasts/podcasts.jpg',
        'date' => [
            'htmlFormat' => '2021-03-22',
            'viewFormat' => '22 марта 2021',
        ],
        'titleForIndexBlog' => 'Обучение через подкасты',
        'descriptionForIndexBlog' => 'В своих предыдущих статьях я не раз ссылался при самообучении на такие способы как: чтение книг, просмотр Ютуба, разбор ссылок, подкасты. В этой статье речь пойдет как раз о подкастах...',
        'status' => 1
    ],
];