<?php

return [
    'ru/blog/run-2024' => [
        'title' => 'Статистика бега за 2024 год: рекорды, дистанции и достижения',
        'metaDescription' => 'Узнайте о результатах бегового года: рекордное количество пробежек, суммарное расстояние в 509 км, ключевые показатели и графики. Итоги бега за 2024 год в цифрах и фактах.',
        'h1' => 'Итоги бегового года 2024',
        'url' => 'https://shitik.com/ru/blog/run-2024',
        'preview' => 'https://shitik.com/images/blog/2024/run-2024/run-2024.jpg',
        'date' => [
            'htmlFormat' => '2024-12-30',
            'viewFormat' => '30 декабря 2024',
        ],
        'titleForIndexBlog' => 'Итоги бегового года 2024',
        'descriptionForIndexBlog' => 'Пришло время опубликовать статистику бега за 2024 год. В плане бега этот год оказался одним из самых благоприятных и результативных. Да, возможно, в этом году я не ставил рекордов в виде 18–20 км за одну пробежку (хотя была одна пробежка на 16 км)...',
        'status' => 1
    ],


    'ru/blog/when-traveling-becomes-easy' => [
        'title' => 'Преодоление барьеров для путешествий: технологии, идеи и будущее без границ',
        'metaDescription' => 'Узнайте, какие мелкие, но значительные барьеры мешают путешествовать по миру и какие технологии и идеи могут помочь их преодолеть. Исследуем языковые, интернет-проблемы, визы и другие аспекты, которые могут улучшить ваш опыт путешествий.',
        'h1' => 'Барьеры на пути к путешествиям',
        'url' => 'https://shitik.com/ru/blog/when-traveling-becomes-easy',
        'preview' => 'https://shitik.com/images/blog/2024/when-traveling-becomes-easy/when-traveling-becomes-easy.jpg',
        'date' => [
            'htmlFormat' => '2024-11-09',
            'viewFormat' => '09 ноября 2024',
        ],
        'titleForIndexBlog' => 'Барьеры на пути к путешествиям',
        'descriptionForIndexBlog' => 'Многие люди хотят путешествовать по миру (а через лет 150 и по другим небесным объектам), но существует множество преград, которые мешают это делать. Мы сейчас конечно же еще не будем рассматривать космическое путешествие, а сосредоточимся исключительно на перемещениях по родной Земле. Основная причина, мешающая путешествиям...',
        'status' => 1
    ],

    'ru/blog/books-2024' => [
        'title' => 'Какие книги я прочитал в 2024 году: Итоги и рекомендации',
        'metaDescription' => 'Узнайте, как я выполнил свой книжный план к началу ноября, изменив подход к чтению. Ознакомьтесь с полным списком прочитанных книг и моими рекомендациями на основе личного опыта.',
        'h1' => 'Результаты чтения книг в 2024 году',
        'url' => 'https://shitik.com/ru/blog/books-2024',
        'preview' => 'https://shitik.com/images/blog/2024/books-2024/books-2024.jpg',
        'date' => [
            'htmlFormat' => '2024-11-08',
            'viewFormat' => '08 ноября 2024',
        ],
        'titleForIndexBlog' => 'Результаты чтения книг в 2024 году',
        'descriptionForIndexBlog' => 'Начало ноября и я уже выполнил поставленный план по прочтению в этом году, так что больше ближайшие пару месяцев читать книги не собираюсь. Сначала пару слов о том, что изменилось в моем подходе к прочтению книг, а затем как обычно представлю список книг, которые я читал в этом году...',
        'status' => 1
    ],

    'ru/blog/trip-to-bali' => [
        'title' => 'Достопримечательности Бали. Обзор недавнего путешествия на Бали',
        'metaDescription' => 'Хотите узнать, что такое Бали? Поделюсь своими впечатлениями о пляжах, природе, культуре и особенностях жизни на этом экзотическом острове.',
        'h1' => 'Путешествие по Бали: воспоминания и открытия',
        'url' => 'https://shitik.com/ru/blog/trip-to-bali',
        'preview' => 'https://shitik.com/images/blog/2024/trip-to-bali/trip-to-bali.jpg',
        'date' => [
            'htmlFormat' => '2024-11-01',
            'viewFormat' => '01 ноября 2024',
        ],
        'titleForIndexBlog' => 'Путешествие по Бали: воспоминания и открытия',
        'descriptionForIndexBlog' => 'Совсем недавно мы с супругой посетили Бали, поэтому, пока воспоминания еще максимально свежие, самое время написать об этом статью, и передать все впечатления. Бали это один из множества островов, принадлежащих Индонезии. Расположен в Южном полушарии Земли, очень близко к Экватору. Также достаточно близко к Австралии.',
        'status' => 1
    ],

    'ru/blog/who-are-quadrobers' => [
        'title' => 'Кто такие квадроберы? История и определение',
        'metaDescription' => 'Узнайте, кто такие квадроберы, откуда пришел этот тренд и как он связан с культурой фурри. Погрузитесь в мир имитации поведения животных среди молодежи и его уникальные аспекты.',
        'h1' => 'Откуда появились квадроберы?',
        'url' => 'https://shitik.com/ru/blog/who-are-quadrobers',
        'preview' => 'https://shitik.com/images/blog/2024/who-are-quadrobers/who-are-quadrobers.jpg',
        'date' => [
            'htmlFormat' => '2024-10-30',
            'viewFormat' => '30 октября 2024',
        ],
        'titleForIndexBlog' => 'Откуда появились квадроберы?',
        'descriptionForIndexBlog' => 'В этой статье опишу хайповую нынче тему квадроберов, кто они такие и откуда появились.Квадроберы это люди, в первую очередь дети и подростки, которые своим поведением имитируют поведение животных...',
        'status' => 1
    ],

    'ru/blog/working-while-lying-on-the-beach' => [
        'title' => 'Пляжная работа: мифы и реальность',
        'metaDescription' => 'Узнайте, почему работа на пляже может быть неэффективной. Пять причин, включая отвлекающие факторы, яркий свет и неудобные условия, которые мешают сосредоточиться.',
        'h1' => 'Почему работать на пляже — это не так удобно, как кажется',
        'url' => 'https://shitik.com/ru/blog/working-while-lying-on-the-beach',
        'preview' => 'https://shitik.com/images/blog/2024/working-while-lying-on-the-beach/working-while-lying-on-the-beach.jpg',
        'date' => [
            'htmlFormat' => '2024-10-26',
            'viewFormat' => '26 октября 2024',
        ],
        'titleForIndexBlog' => 'Почему работать на пляже — это не так удобно, как кажется',
        'descriptionForIndexBlog' => 'Не так давно я посетил одну из теплых стран, а вернее ее остров, о чем подробно расскажу в другой статье. На протяжении примерно половины отдыха у меня была возможность воспользоваться ноутбуком, прямо лежа на пляже. Опыт из этого получился, как мне показалось, не очень положительный, и я будучи человеком, который написал книгу...',
        'status' => 1
    ],
    'ru/blog/names-of-hurricanes' => [
        'title' => 'Как именуют ураганы: история, правила и интересные факты',
        'metaDescription' => 'Узнайте, откуда берутся имена ураганов, как Всемирная метеорологическая организация выбирает названия и почему некоторые штормы остаются без имен. История и традиции именования тропических штормов.',
        'h1' => 'Кто и как дает имена ураганам?',
        'url' => 'https://shitik.com/ru/blog/names-of-hurricanes',
        'preview' => 'https://shitik.com/images/blog/2024/names-of-hurricanes/names-of-hurricanes.jpg',
        'date' => [
            'htmlFormat' => '2024-10-23',
            'viewFormat' => '23 октября 2024',
        ],
        'titleForIndexBlog' => 'Кто и как дает имена ураганам?',
        'descriptionForIndexBlog' => 'Задумывались ли вы когда-нибудь, кто и как дает имена разрушительным смерчам, которые практически каждый год обрушиваются на те или иные побережья? Флойд, Эллисон, Айрин, Сэнди и другие имена. Откуда они берутся, и кто назначает их именами...',
        'status' => 1
    ],

    'ru/blog/national-vaccination-calendar' => [
        'title' => 'Что такое национальный календарь прививок: обязательные и рекомендуемые прививки для граждан',
        'metaDescription' => 'Узнайте о национальном календаре прививок, который определяет список обязательных и рекомендуемых прививок для граждан каждой страны. Познакомьтесь с примерами национальных календарей прививок разных стран и узнайте, какие прививки рекомендуется делать при путешествиях.',
        'h1' => 'Что такое национальный календарь прививок?',
        'url' => 'https://shitik.com/ru/blog/national-vaccination-calendar',
        'preview' => 'https://shitik.com/images/blog/2024/national-vaccination-calendar/national-vaccination-calendar.jpg',
        'date' => [
            'htmlFormat' => '2024-06-22',
            'viewFormat' => '22 июня 2024',
        ],
        'titleForIndexBlog' => 'Что такое национальный календарь прививок?',
        'descriptionForIndexBlog' => 'Знаете ли вы, что такое национальный календарь прививок? Если нет, то самое время познакомиться с этим термином, а скорее даже инстанцией. Вообще говоря определение этого крайне короткое. Это все прививки, которые могут быть как обязательными, так и рекомендованными для граждан конкретной страны...',
        'status' => 1
    ],
    'ru/blog/where-do-lefties-come-from' => [
        'title' => 'Откуда берутся левши? Правша или левша: наука, заблуждения и интересные факты',
        'metaDescription' => 'Узнайте, почему люди бывают правшами или левшами, с какого возраста это проявляется, влияет ли на интеллект и можно ли переучить. Разберемся в научных фактах и развеем мифы о леворукости.',
        'h1' => 'Откуда берутся левши?',
        'url' => 'https://shitik.com/ru/blog/where-do-lefties-come-from',
        'preview' => 'https://shitik.com/images/blog/2024/where-do-lefties-come-from/where-do-lefties-come-from.jpg',
        'date' => [
            'htmlFormat' => '2024-06-21',
            'viewFormat' => '21 июня 2024',
        ],
        'titleForIndexBlog' => 'Откуда берутся левши?',
        'descriptionForIndexBlog' => 'Не так давно я задался вопросом о том, почему люди могут быть правшой или левшой. Мне захотелось слегка в этом разобраться, и результатами я решил поделиться в виде статьи. Какие же наиболее популярные вопросы возникли у меня в голове при поднятии данного вопроса. Первый и самый главный звучал примерно так...',
        'status' => 1
    ],
    'ru/blog/trip-to-georgia' => [
        'title' => 'Достопримечательности, путешествие и исследование Тбилиси, Грузии и местного образа жизни: впечатления и особенности',
        'metaDescription' => 'Подробный обзор недавнего путешествия по Грузии, включая впечатления о Тбилиси, местном вождении, условиях проживания в различных городах, а также обзор достопримечательностей, цен и особенностей населения.',
        'h1' => 'Путешествие по Грузии: от Тбилиси до Батуми',
        'url' => 'https://shitik.com/ru/blog/trip-to-georgia',
        'preview' => 'https://shitik.com/images/blog/2024/trip-to-georgia/trip-to-georgia.jpg',
        'date' => [
            'htmlFormat' => '2024-04-20',
            'viewFormat' => '20 апреля 2024',
        ],
        'titleForIndexBlog' => 'Путешествие по Грузии: от Тбилиси до Батуми',
        'descriptionForIndexBlog' => 'Второй страной в недавней поездке после Азербайджана была Грузия. Как проходили наши приключения сейчас также кратко расскажу...',
        'status' => 1
    ],
    'ru/blog/trip-to-azerbaijan' => [
        'title' => 'Достопримечательности Баку и Азербайджана. Наша поездка: впечатления о Баку, красотах страны и особенностях вождения',
        'metaDescription' => 'Мы провели целую неделю, путешествуя по Азербайджану - от столицы Баку до более мелких городов. В статье мы делимся впечатлениями о поездке, описываем достопримечательности этих городов и особенности Азербайджана.',
        'h1' => 'Путешествие по Азербайджану: от Баку до Мингечаура',
        'url' => 'https://shitik.com/ru/blog/trip-to-azerbaijan',
        'preview' => 'https://shitik.com/images/blog/2024/trip-to-azerbaijan/trip-to-azerbaijan.jpg',
        'date' => [
            'htmlFormat' => '2024-04-19',
            'viewFormat' => '19 апреля 2024',
        ],
        'titleForIndexBlog' => 'Путешествие по Азербайджану: от Баку до Мингечаура',
        'descriptionForIndexBlog' => 'Не так давно у нас была активная поездка в Азербайджан. Мы на несколько дней остановились в Баку, после чего взяли напрокат машину и поехали по всей стране. Что из этого получилось, и какие были впечатления, постараюсь рассказать ниже...',
        'status' => 1
    ],

    'ru/blog/humanities-and-exact-sciences' => [
        'title' => 'Точные против гуманитарных наук: Почему я выбрал точные науки?',
        'metaDescription' => 'В статье обсуждается мое отношение к точным и гуманитарных наукам на примере реального жизненного случая.',
        'h1' => 'Точные и гуманитарные науки: мой выбор и предпочтения',
        'url' => 'https://shitik.com/ru/blog/humanities-and-exact-sciences',
        'preview' => 'https://shitik.com/images/blog/2024/humanities-and-exact-sciences/humanities-and-exact-sciences.jpg',
        'date' => [
            'htmlFormat' => '2024-03-16',
            'viewFormat' => '16 марта 2024',
        ],
        'titleForIndexBlog' => 'Точные и гуманитарные науки: мой выбор и предпочтения',
        'descriptionForIndexBlog' => 'Все прекрасно знают, какие науки относятся к точным, а какие к гуманитарным. Однако мало кто задумывался, почему люди выбирают те или иные науки как любимые и изучают их как хобби или же идут еще дальше и получают образование по той или иной дисциплине....',
        'status' => 1
    ],
    'ru/blog/short-cartoons' => [
        'title' => 'Короткометражные мультфильмы: их значение, особенности и история',
        'metaDescription' => 'Узнайте о короткометражных мультфильмах, их роли в индустрии анимации и почему они важны для режиссеров. Исследуйте историю короткометражек и узнайте о наградах, таких как «Лучший короткометражный мультфильм» на кинопремии «Оскар».',
        'h1' => 'Смотрю короткометражки, но не те, о которых вы подумали',
        'url' => 'https://shitik.com/ru/blog/short-cartoons',
        'preview' => 'https://shitik.com/images/blog/2024/short-cartoons/short-cartoons.jpg',
        'date' => [
            'htmlFormat' => '2024-02-10',
            'viewFormat' => '10 февраля 2024',
        ],
        'titleForIndexBlog' => 'Смотрю короткометражки, но не те, о которых вы подумали',
        'descriptionForIndexBlog' => 'В этой статье речь пойдет о короткометражках. Нет, не о порно :) А о мультфильмах. Да-да, в мире мультфильмов также есть свои короткометражки и сейчас я немного о них расскажу. Короткометражки - это очень короткие мультфильмы от нескольких минут до нескольких десятков (а в некоторых случаях и больше) минут.',
        'status' => 1
    ],
    'ru/blog/time-magazine-person-of-the-year' => [
        'title' => 'Проблема недооценки ученых и инженеров в обществе и премия «Человек года»',
        'metaDescription' => 'В статье рассматривается проблема недооценки ученых и инженеров в обществе, а также критика премии «Человек года» за приоритетность спортсменов и музыкантов. Автор высказывает свое мнение о том, что премия должна быть вручена тем, кто вносит значительный вклад в научный прогресс и создает полезные инновации для человечества.',
        'h1' => 'Журнал Time. Человек года. Кому бы я отдавал премию',
        'url' => 'https://shitik.com/ru/blog/time-magazine-person-of-the-year',
        'preview' => 'https://shitik.com/images/blog/2024/time-magazine-person-of-the-year/time-magazine-person-of-the-year.jpg',
        'date' => [
            'htmlFormat' => '2024-01-17',
            'viewFormat' => '17 января 2024',
        ],
        'titleForIndexBlog' => 'Журнал Times. Человек года. Кому бы я отдавал премию',
        'descriptionForIndexBlog' => 'Каждый год известный журнал Times присуждает премию Человек года. В качестве номинантов на эту премию выбираются самые разные категории людей: музыканты, политики, бизнесмены, актеры, ученые и многие другие. Логика добавления достаточно понятна: те, кто на слуху, те, кто в трендах, те, кто сделал хоть что-то влиятельное в этом году....',
        'status' => 1
    ],
    'ru/blog/steve-jobs-and-pixar' => [
        'title' => 'Удивительная история успеха компании Pixar: влияние Стива Джобса',
        'metaDescription' => 'Узнайте о важной роли, которую Стив Джобс сыграл в успехе компании Pixar, и как его руководство и наставничество привели к созданию культовых мультфильмов, которые завоевали сердца миллионов зрителей. Открытые контракты, слияние с Диснеем и неизлечимая болезнь - все эти факторы сделали Pixar величайшим достижением Джобса.',
        'h1' => 'Не только Apple. Стив Джобс успешный владелец Pixar',
        'url' => 'https://shitik.com/ru/blog/steve-jobs-and-pixar',
        'preview' => 'https://shitik.com/images/blog/2024/steve-jobs-and-pixar/steve-jobs-and-pixar.jpg',
        'date' => [
            'htmlFormat' => '2024-01-14',
            'viewFormat' => '14 января 2024',
        ],
        'titleForIndexBlog' => 'Не только Apple. Стив Джобс успешный владелец Pixar',
        'descriptionForIndexBlog' => 'Деятельность и характер Стива Джобса безусловно вызывает у меня симпатию, однако вряд ли этот человек входит в топ 3 моих кумира, и если бы я писал что-то о своих кумирах, то в первую очередь это были бы Хокинг и Меркьюри. Однако, нашлась одна веская причина, по которой я решил написать именно про Джобса...',
        'status' => 1
    ],

];