<?php
includeCSS(['modules/general', 'modules/fonts', 'modules/header', 'modules/breadcrumb', 'modules/content']);
include DOCUMENT_ROOT . '/view/v3/head.php';
$posts = getPosts();
?>
<body>
<?php include DOCUMENT_ROOT . '/view/v3/menu.php'; ?>
<main class="container">
    <ul class="breadcrumb">
        <li><a href="/ru">Главная</a></li>
        <li><a href="/ru/blog">Блог</a></li>
        <li class="active"><?php echo getSeoField('h1') ?></li>
    </ul>
    <div class="content">
        <h1><?php echo getSeoField('h1') ?></h1>
        <time datetime="<?php echo getSeoField('date.htmlFormat') ?>" class="date-pub"><?php echo getSeoField('date.viewFormat') ?></time>

        <p>Человеческий цивилизация 👽 слишком слаба и зависима от разных факторов: наличие кислорода в нужной объеме, подходящие давление и температура, защита от радиации, постоянная нужда в питье и еде. Вселенная настолько велика, что вполне можно допустить существование цивилизации совершенно других форм, не имеющих физической оболочки и соответственно не нуждающаяся в ряде вышеперечисленных зависимостей.</p>

        <p>Задумывались ли вы когда-либо о том, как могла развиться наша цивилизация, если населяющие нашу планету существа не нуждались в приеме пищи 🥦‍🍳 и питье 🥤. Скажем, получение необходимой энергии для поддержания необходимых жизненных процессов хватало бы только от нашей звезды 🌞. Представили? Постараюсь мысль последовательно не перепрыгивая по пунктам. И так, поехали..</p>

        <p>Самое очевидное что приходит в голову и от чего можно отталкиваться при размышлении это то, что в наших квартирах 🏢 полностью бы исчезла такая комната как кухня, а возможно даже и туалет, что вполне логично. Наша жилая площадь в квартире стала бы больше. Ну или бы было бы больше квартир в той же самой площади дома.</p>

        <p>Прием пищи это неотчетливая часть дня. У разных людей он занимает разное время. Кто-то умудряется поесть на работе перекусами, а кто-то наслаждается каждым прием пищи и у таких людей завтрак, обед и тем более ужин может затянуться очень на долго. Точно так же как человек тратит свое время на лифт, сон, душ он тратит время на прием пищи. Суммарно люди тратят колоссально много времени на прием пищи если это все перевести в работа-часы. За всю историю человечество “прожрало” столько времени, сколько бы наверно хватило на освоение новой технологии 🛰 🚀 и не одной. Таким образом после отсутствия кухни и туалета в доме следующий вывод, который можно сделать, это то, что развитие науки 🔬 значительно ушло бы вперед чем есть сейчас.</p>

        <p>Большая часть продуктов питаний, который употребляет человек необходимо вырастить в земле. Для этих целей надо использовать больше участки земли. Соответственно если бы человек  не нуждался в еде на месте современных полей с различными с/х культурами 🌽  ‍🌾 мы могли бы использовать землю в других целях.</p>

        <p>Отсутствие продуктов питания и потребности в еде означало бы, что у нас не было бы всех заводов ‍🏭 и магазинов пищевой промышленности.</p>

        <p>Это бы в свою очередь полностью повлияло на перераспределение рабочих мест на рынке 👨🏽‍🌾 👩🏽‍🍳. Однако про это еще поговорим далее.</p>

        <p>Отсутствие потребности в еде наверняка бы уменьшало количество болезней эпидемий и пандемий ⚕️🦠. Во-первых люди не стали бы есть животных, которые сами являются переносчиками каких-либо болезней. Во-вторых уровень гигиены у многих такой, что они готовы даже здоровые продукты нести в рот не помыв 🧼 ни продукты ни собственные руки. В-третьи реже стали бы появляться болезни связанные с неправильным и плохим питанием: гастриты, язвы и даже некоторые формы рака.</p>

        <p>Формат празднование застолья 🎉🥂 изменился бы на другой. Людям бы больше не пришлось веселиться и при этом пить и есть. Будь Новый Год или день Рождения пришлось искать другой формат развлечения.</p>

        <p>Если бы люди не нуждались в еде и питье соответственно они бы не было бы алкоголя 🥃, ровно как и смертей в состоянии алкоголя.</p>

        <p>Сейчас чтобы стать успешной страной необязательно иметь большую площадь с хорошими землями. Годовые обороны IT-компаний гигантов 👨🏼‍💻🌐 зачастую больше ВВП некоторых стран. Однако так было не всегда. Тысячу и более лет назад войны 💣⚔️ действительно могли начаться только потому, что у соседей более пригодные и плодотворные земли. По этому отсутствие  потребности в пище хоть и незначительно, но уменьшало бы количество воин.</p>

        <p>Раз уж затронули предыдущие тысячелетия, то не стоит забывать что во многих странах способами оплаты 💵 долгое время была какая-то еда. Меняли одну единицу товара на другую. Не будь еды древним людям изначально бы пришлось придумывать монеты и биткоины :)</p>

        <p>Так же очень сильно бы изменились жизненные ценности людей и их взгляды на жизнь 🤔🧘🏼‍. Человеку не надо было думать как прокормить свою семью и какая работа более прибыльная. Стало бы еще больше безработных и это бы не воспринималось бы так сильно в штыки, как в современном обществе любой страны.</p>

        <p>И последний, но тоже очень существенный факт. Наша природа 🌍 была бы намного чище и более здоровой. В реках, морях и океанах 🌊 не плавали тонны полиэтиленовых упаковок и пластиковых бутылок. Кстати, если вы спросите меня в современном мире, где человек нуждается в еде “за” полиэтилен и пластик я или “против” его мой ответ будет однозначно “за”. И на это у меня есть весомый развернутый ответ с цифрами. Возможно когда-нить я и про это напишу статью, но это уже совсем другая история.</p>

    </div>
</main>
<?php include DOCUMENT_ROOT . '/view/v3/footer.php'; ?>
<?php include DOCUMENT_ROOT . '/view/v3/js-scripts.php'; ?>
</body>
</html>
