<?php

return [
    'ru' => [
        'title' => 'Персональный сайт веб-разработчика Александра Андреевича Шитика',
        'metaDescription' => 'Добро пожаловать на мой персональный сайт посвященный разработке сайтов и веб-приложений. Здесь вы можете узнать информацию обо мне, ознакомится с моими работами или посетить мой блог о программировании.',
        'h1' => 'Шитик Александр Андреевич',
        'url' => 'https://shitik.com/ru',
        'preview' => 'https://shitik.com/themes/v3/images/about/photo.jpg'
    ],
    'ru/alexandr-andreevich' => [
        'title' => 'Шитик Александр Андреевич',
        'metaDescription' => 'На данной странице представлена основная информация обо мне, где учился, какие языки и технологии программирования знаю и использую в работе.',
        'h1' => 'Шитик Александр Андреевич',
        'url' => 'https://shitik.com/ru/alexandr-andreevich',
        'preview' => 'https://shitik.com/themes/v3/images/about/photo.jpg'
    ],
    'ru/blog' => [
        'title' => 'Блог с записями',
        'metaDescription' => 'Мысли в слух о программировании и не только',
        'h1' => 'Список постов',
        'url' => 'https://shitik.com/ru/blog',
        'preview' => 'https://shitik.com/images/preview/blog.jpeg'
    ],
    'ru/portfolio' => [
        'title' => 'Шитик Александр Андреевич - Портфолио',
        'metaDescription' => 'Список выполненных мною работ по разработке сайтов, веб приложений, десктопных приложений и сервисов для android-приложений.',
        'h1' => 'Портфолио',
        'url' => 'https://shitik.com/ru/portfolio',
        'preview' => 'https://shitik.com/images/preview/portfolio.webp'
    ],
    'ru/travels' => [
        'title' => 'Список стран в которых я побывал',
        'metaDescription' => 'Страница, на которой я планирую публиковать посещенные страны, а также в будущем возможно публиковать фотографии из поездок.',
        'h1' => '',
        'url' => 'https://shitik.com/ru/travels',
        'preview' => 'https://shitik.com/images/preview/travels.jpeg'
    ],
    'ru/projects' => [
        'title' => 'Мои хобби проекты и идеи',
        'metaDescription' => 'Список некоторых реализованных моих идей. От CMS движка и фреймворка до странных сайтов. ',
        'h1' => '',
        'url' => 'https://shitik.com/ru/projects',
        'preview' => 'https://shitik.com/images/preview/projects.jpeg'
    ],
    'library' => [
        'title' => 'Перечень книг, которые я успел прочитать начиная с 2020 года',
        'metaDescription' => 'Моя виртуальная библиотека. Полный список книг с оценками и рекомендациями, которые я почитал за последнее время.',
        'h1' => '',
        'url' => 'https://shitik.com/ru/library',
        'preview' => 'https://shitik.com/images/preview/library.jpeg'
    ],
    'ru/stats' => [
        'title' => 'Статистика по некоторым метрикам и показателям',
        'metaDescription' => 'Перечень некоторых показателей, которые я решил залить в публичный доступ.',
        'h1' => '',
        'url' => 'https://shitik.com/ru/stats',
        'preview' => 'https://shitik.com/images/preview/stats.jpeg'
    ],
    'ru/site' => [
        'title' => 'Страницы сайта в различных валидаторах',
        'metaDescription' => 'Список всех страниц в распространенных валидаторах таких как: html w3c, google speed insight и другие.',
        'h1' => '',
        'url' => 'https://shitik.com/ru/site',
        'preview' => 'https://shitik.com/images/preview/site.webp'
    ],
    'ru/sitemap' => [
        'title' => 'Список всех страниц сайта',
        'metaDescription' => 'Полный перечень всех страниц сайта shitik.by',
        'h1' => '',
        'url' => 'https://shitik.com/ru/sitemap',
        'preview' => 'https://shitik.com/images/preview/sitemap.jpeg'
    ],


    // blog posts


    // 2024
    'ru/blog/when-traveling-becomes-easy' => [
        'title' => 'Преодоление барьеров для путешествий: технологии, идеи и будущее без границ',
        'metaDescription' => 'Узнайте, какие мелкие, но значительные барьеры мешают путешествовать по миру и какие технологии и идеи могут помочь их преодолеть. Исследуем языковые, интернет-проблемы, визы и другие аспекты, которые могут улучшить ваш опыт путешествий.',
        'h1' => 'Барьеры на пути к путешествиям',
        'url' => 'https://shitik.com/ru/blog/when-traveling-becomes-easy',
        'preview' => 'https://shitik.com/images/blog/2024/when-traveling-becomes-easy/when-traveling-becomes-easy.jpg',
        'date' => [
            'htmlFormat' => '2024-11-09',
            'viewFormat' => '09 ноября 2024',
        ],
        'titleForIndexBlog' => 'Барьеры на пути к путешествиям',
        'descriptionForIndexBlog' => 'Многие люди хотят путешествовать по миру (а через лет 150 и по другим небесным объектам), но существует множество преград, которые мешают это делать. Мы сейчас конечно же еще не будем рассматривать космическое путешествие, а сосредоточимся исключительно на перемещениях по родной Земле. Основная причина, мешающая путешествиям...'
    ],

    'ru/blog/books-2024' => [
        'title' => 'Какие книги я прочитал в 2024 году: Итоги и рекомендации',
        'metaDescription' => 'Узнайте, как я выполнил свой книжный план к началу ноября, изменив подход к чтению. Ознакомьтесь с полным списком прочитанных книг и моими рекомендациями на основе личного опыта.',
        'h1' => 'Результаты чтения книг в 2024 году',
        'url' => 'https://shitik.com/ru/blog/books-2024',
        'preview' => 'https://shitik.com/images/blog/2024/books-2024/books-2024.jpg',
        'date' => [
            'htmlFormat' => '2024-11-08',
            'viewFormat' => '08 ноября 2024',
        ],
        'titleForIndexBlog' => 'Результаты чтения книг в 2024 году',
        'descriptionForIndexBlog' => 'Начало ноября и я уже выполнил поставленный план по прочтению в этом году, так что больше ближайшие пару месяцев читать книги не собираюсь. Сначала пару слов о том, что изменилось в моем подходе к прочтению книг, а затем как обычно представлю список книг, которые я читал в этом году...'
    ],

    'ru/blog/trip-to-bali' => [
        'title' => 'Достопримечательности Бали. Обзор недавнего путешествия на Бали',
        'metaDescription' => 'Хотите узнать, что такое Бали? Поделюсь своими впечатлениями о пляжах, природе, культуре и особенностях жизни на этом экзотическом острове.',
        'h1' => 'Путешествие по Бали: воспоминания и открытия',
        'url' => 'https://shitik.com/ru/blog/trip-to-bali',
        'preview' => 'https://shitik.com/images/blog/2024/trip-to-bali/trip-to-bali.jpg',
        'date' => [
            'htmlFormat' => '2024-11-01',
            'viewFormat' => '01 ноября 2024',
        ],
        'titleForIndexBlog' => 'Путешествие по Бали: воспоминания и открытия',
        'descriptionForIndexBlog' => 'Совсем недавно мы с супругой посетили Бали, поэтому, пока воспоминания еще максимально свежие, самое время написать об этом статью, и передать все впечатления. Бали это один из множества островов, принадлежащих Индонезии. Расположен в Южном полушарии Земли, очень близко к Экватору. Также достаточно близко к Австралии.'
    ],

    'ru/blog/who-are-quadrobers' => [
        'title' => 'Кто такие квадроберы? История и определение',
        'metaDescription' => 'Узнайте, кто такие квадроберы, откуда пришел этот тренд и как он связан с культурой фурри. Погрузитесь в мир имитации поведения животных среди молодежи и его уникальные аспекты.',
        'h1' => 'Откуда появились квадроберы?',
        'url' => 'https://shitik.com/ru/blog/who-are-quadrobers',
        'preview' => 'https://shitik.com/images/blog/2024/who-are-quadrobers/who-are-quadrobers.jpg',
        'date' => [
            'htmlFormat' => '2024-10-30',
            'viewFormat' => '30 октября 2024',
        ],
        'titleForIndexBlog' => 'Откуда появились квадроберы?',
        'descriptionForIndexBlog' => 'В этой статье опишу хайповую нынче тему квадроберов, кто они такие и откуда появились.Квадроберы это люди, в первую очередь дети и подростки, которые своим поведением имитируют поведение животных...'
    ],

    'ru/blog/working-while-lying-on-the-beach' => [
        'title' => 'Пляжная работа: мифы и реальность',
        'metaDescription' => 'Узнайте, почему работа на пляже может быть неэффективной. Пять причин, включая отвлекающие факторы, яркий свет и неудобные условия, которые мешают сосредоточиться.',
        'h1' => 'Почему работать на пляже — это не так удобно, как кажется',
        'url' => 'https://shitik.com/ru/blog/working-while-lying-on-the-beach',
        'preview' => 'https://shitik.com/images/blog/2024/working-while-lying-on-the-beach/working-while-lying-on-the-beach.jpg',
        'date' => [
            'htmlFormat' => '2024-10-26',
            'viewFormat' => '26 октября 2024',
        ],
        'titleForIndexBlog' => 'Почему работать на пляже — это не так удобно, как кажется',
        'descriptionForIndexBlog' => 'Не так давно я посетил одну из теплых стран, а вернее ее остров, о чем подробно расскажу в другой статье. На протяжении примерно половины отдыха у меня была возможность воспользоваться ноутбуком, прямо лежа на пляже. Опыт из этого получился, как мне показалось, не очень положительный, и я будучи человеком, который написал книгу...'
    ],
    'ru/blog/names-of-hurricanes' => [
        'title' => 'Как именуют ураганы: история, правила и интересные факты',
        'metaDescription' => 'Узнайте, откуда берутся имена ураганов, как Всемирная метеорологическая организация выбирает названия и почему некоторые штормы остаются без имен. История и традиции именования тропических штормов.',
        'h1' => 'Кто и как дает имена ураганам?',
        'url' => 'https://shitik.com/ru/blog/names-of-hurricanes',
        'preview' => 'https://shitik.com/images/blog/2024/names-of-hurricanes/names-of-hurricanes.jpg',
        'date' => [
            'htmlFormat' => '2024-10-23',
            'viewFormat' => '23 октября 2024',
        ],
        'titleForIndexBlog' => 'Кто и как дает имена ураганам?',
        'descriptionForIndexBlog' => 'Задумывались ли вы когда-нибудь, кто и как дает имена разрушительным смерчам, которые практически каждый год обрушиваются на те или иные побережья? Флойд, Эллисон, Айрин, Сэнди и другие имена. Откуда они берутся, и кто назначает их именами...'
    ],

    'ru/blog/national-vaccination-calendar' => [
        'title' => 'Что такое национальный календарь прививок: обязательные и рекомендуемые прививки для граждан',
        'metaDescription' => 'Узнайте о национальном календаре прививок, который определяет список обязательных и рекомендуемых прививок для граждан каждой страны. Познакомьтесь с примерами национальных календарей прививок разных стран и узнайте, какие прививки рекомендуется делать при путешествиях.',
        'h1' => 'Что такое национальный календарь прививок?',
        'url' => 'https://shitik.com/ru/blog/national-vaccination-calendar',
        'preview' => 'https://shitik.com/images/blog/2024/national-vaccination-calendar/national-vaccination-calendar.jpg',
        'date' => [
            'htmlFormat' => '2024-06-22',
            'viewFormat' => '22 июня 2024',
        ],
        'titleForIndexBlog' => 'Что такое национальный календарь прививок?',
        'descriptionForIndexBlog' => 'Знаете ли вы, что такое национальный календарь прививок? Если нет, то самое время познакомиться с этим термином, а скорее даже инстанцией. Вообще говоря определение этого крайне короткое. Это все прививки, которые могут быть как обязательными, так и рекомендованными для граждан конкретной страны...'
    ],
    'ru/blog/where-do-lefties-come-from' => [
        'title' => 'Откуда берутся левши? Правша или левша: наука, заблуждения и интересные факты',
        'metaDescription' => 'Узнайте, почему люди бывают правшами или левшами, с какого возраста это проявляется, влияет ли на интеллект и можно ли переучить. Разберемся в научных фактах и развеем мифы о леворукости.',
        'h1' => 'Откуда берутся левши?',
        'url' => 'https://shitik.com/ru/blog/where-do-lefties-come-from',
        'preview' => 'https://shitik.com/images/blog/2024/where-do-lefties-come-from/where-do-lefties-come-from.jpg',
        'date' => [
            'htmlFormat' => '2024-06-21',
            'viewFormat' => '21 июня 2024',
        ],
        'titleForIndexBlog' => 'Откуда берутся левши?',
        'descriptionForIndexBlog' => 'Не так давно я задался вопросом о том, почему люди могут быть правшой или левшой. Мне захотелось слегка в этом разобраться, и результатами я решил поделиться в виде статьи. Какие же наиболее популярные вопросы возникли у меня в голове при поднятии данного вопроса. Первый и самый главный звучал примерно так...'
    ],
    'ru/blog/trip-to-georgia' => [
        'title' => 'Достопримечательности, путешествие и исследование Тбилиси, Грузии и местного образа жизни: впечатления и особенности',
        'metaDescription' => 'Подробный обзор недавнего путешествия по Грузии, включая впечатления о Тбилиси, местном вождении, условиях проживания в различных городах, а также обзор достопримечательностей, цен и особенностей населения.',
        'h1' => 'Путешествие по Грузии: от Тбилиси до Батуми',
        'url' => 'https://shitik.com/ru/blog/trip-to-georgia',
        'preview' => 'https://shitik.com/images/blog/2024/trip-to-georgia/trip-to-georgia.jpg',
        'date' => [
            'htmlFormat' => '2024-04-20',
            'viewFormat' => '20 апреля 2024',
        ],
        'titleForIndexBlog' => 'Путешествие по Грузии: от Тбилиси до Батуми',
        'descriptionForIndexBlog' => 'Второй страной в недавней поездке после Азербайджана была Грузия. Как проходили наши приключения сейчас также кратко расскажу...'
    ],
    'ru/blog/trip-to-azerbaijan' => [
        'title' => 'Достопримечательности Баку и Азербайджана. Наша поездка: впечатления о Баку, красотах страны и особенностях вождения',
        'metaDescription' => 'Мы провели целую неделю, путешествуя по Азербайджану - от столицы Баку до более мелких городов. В статье мы делимся впечатлениями о поездке, описываем достопримечательности этих городов и особенности Азербайджана.',
        'h1' => 'Путешествие по Азербайджану: от Баку до Мингечаура',
        'url' => 'https://shitik.com/ru/blog/trip-to-azerbaijan',
        'preview' => 'https://shitik.com/images/blog/2024/trip-to-azerbaijan/trip-to-azerbaijan.jpg',
        'date' => [
            'htmlFormat' => '2024-04-19',
            'viewFormat' => '19 апреля 2024',
        ],
        'titleForIndexBlog' => 'Путешествие по Азербайджану: от Баку до Мингечаура',
        'descriptionForIndexBlog' => 'Не так давно у нас была активная поездка в Азербайджан. Мы на несколько дней остановились в Баку, после чего взяли напрокат машину и поехали по всей стране. Что из этого получилось, и какие были впечатления, постараюсь рассказать ниже...'
    ],

    'ru/blog/humanities-and-exact-sciences' => [
        'title' => 'Точные против гуманитарных наук: Почему я выбрал точные науки?',
        'metaDescription' => 'В статье обсуждается мое отношение к точным и гуманитарных наукам на примере реального жизненного случая.',
        'h1' => 'Точные и гуманитарные науки: мой выбор и предпочтения',
        'url' => 'https://shitik.com/ru/blog/humanities-and-exact-sciences',
        'preview' => 'https://shitik.com/images/blog/2024/humanities-and-exact-sciences/humanities-and-exact-sciences.jpg',
        'date' => [
            'htmlFormat' => '2024-03-16',
            'viewFormat' => '16 марта 2024',
        ],
        'titleForIndexBlog' => 'Точные и гуманитарные науки: мой выбор и предпочтения',
        'descriptionForIndexBlog' => 'Все прекрасно знают, какие науки относятся к точным, а какие к гуманитарным. Однако мало кто задумывался, почему люди выбирают те или иные науки как любимые и изучают их как хобби или же идут еще дальше и получают образование по той или иной дисциплине....'
    ],
    'ru/blog/short-cartoons' => [
        'title' => 'Короткометражные мультфильмы: их значение, особенности и история',
        'metaDescription' => 'Узнайте о короткометражных мультфильмах, их роли в индустрии анимации и почему они важны для режиссеров. Исследуйте историю короткометражек и узнайте о наградах, таких как «Лучший короткометражный мультфильм» на кинопремии «Оскар».',
        'h1' => 'Смотрю короткометражки, но не те, о которых вы подумали',
        'url' => 'https://shitik.com/ru/blog/short-cartoons',
        'preview' => 'https://shitik.com/images/blog/2024/short-cartoons/short-cartoons.jpg',
        'date' => [
            'htmlFormat' => '2024-02-10',
            'viewFormat' => '10 февраля 2024',
        ],
        'titleForIndexBlog' => 'Смотрю короткометражки, но не те, о которых вы подумали',
        'descriptionForIndexBlog' => 'В этой статье речь пойдет о короткометражках. Нет, не о порно :) А о мультфильмах. Да-да, в мире мультфильмов также есть свои короткометражки и сейчас я немного о них расскажу. Короткометражки - это очень короткие мультфильмы от нескольких минут до нескольких десятков (а в некоторых случаях и больше) минут.'
    ],
    'ru/blog/time-magazine-person-of-the-year' => [
        'title' => 'Проблема недооценки ученых и инженеров в обществе и премия «Человек года»',
        'metaDescription' => 'В статье рассматривается проблема недооценки ученых и инженеров в обществе, а также критика премии «Человек года» за приоритетность спортсменов и музыкантов. Автор высказывает свое мнение о том, что премия должна быть вручена тем, кто вносит значительный вклад в научный прогресс и создает полезные инновации для человечества.',
        'h1' => 'Журнал Time. Человек года. Кому бы я отдавал премию',
        'url' => 'https://shitik.com/ru/blog/time-magazine-person-of-the-year',
        'preview' => 'https://shitik.com/images/blog/2024/time-magazine-person-of-the-year/time-magazine-person-of-the-year.jpg',
        'date' => [
            'htmlFormat' => '2024-01-17',
            'viewFormat' => '17 января 2024',
        ],
        'titleForIndexBlog' => 'Журнал Times. Человек года. Кому бы я отдавал премию',
        'descriptionForIndexBlog' => 'Каждый год известный журнал Times присуждает премию Человек года. В качестве номинантов на эту премию выбираются самые разные категории людей: музыканты, политики, бизнесмены, актеры, ученые и многие другие. Логика добавления достаточно понятна: те, кто на слуху, те, кто в трендах, те, кто сделал хоть что-то влиятельное в этом году....'
    ],
    'ru/blog/steve-jobs-and-pixar' => [
        'title' => 'Удивительная история успеха компании Pixar: влияние Стива Джобса',
        'metaDescription' => 'Узнайте о важной роли, которую Стив Джобс сыграл в успехе компании Pixar, и как его руководство и наставничество привели к созданию культовых мультфильмов, которые завоевали сердца миллионов зрителей. Открытые контракты, слияние с Диснеем и неизлечимая болезнь - все эти факторы сделали Pixar величайшим достижением Джобса.',
        'h1' => 'Не только Apple. Стив Джобс успешный владелец Pixar',
        'url' => 'https://shitik.com/ru/blog/steve-jobs-and-pixar',
        'preview' => 'https://shitik.com/images/blog/2024/steve-jobs-and-pixar/steve-jobs-and-pixar.jpg',
        'date' => [
            'htmlFormat' => '2024-01-14',
            'viewFormat' => '14 января 2024',
        ],
        'titleForIndexBlog' => 'Не только Apple. Стив Джобс успешный владелец Pixar',
        'descriptionForIndexBlog' => 'Деятельность и характер Стива Джобса безусловно вызывает у меня симпатию, однако вряд ли этот человек входит в топ 3 моих кумира, и если бы я писал что-то о своих кумирах, то в первую очередь это были бы Хокинг и Меркьюри. Однако, нашлась одна веская причина, по которой я решил написать именно про Джобса...'
    ],

    // 2023
    'ru/blog/total-2023' => [
        'title' => 'Итоги года: достижения, цели и здоровье',
        'metaDescription' => 'В этой статье рассказываю о достижениях в течение года, основных целях, фразах года, спорте, работе и здоровье и много другом. Узнайте, какие цели были достигнуты, какие препятствия возникали и как автор заботится о своем здоровье.',
        'h1' => 'Итоги 2023 года',
        'url' => 'https://shitik.com/ru/blog/total-2023',
        'preview' => 'https://shitik.com/images/blog/2023/total-2023/total-2023.jpg',
        'date' => [
            'htmlFormat' => '2023-12-29',
            'viewFormat' => '29 декабря 2023',
        ],
        'titleForIndexBlog' => 'Итоги 2023 года',
        'descriptionForIndexBlog' => 'Неоднозначный год, хотя судя по всему вполне успешный. Перейду сразу к целям на год, которые ставил, и тому, насколько мне удалось их осуществить. Было 5 основных целей. Цель 1 - достигнута на 100%, Цель 2 - достигнута на 100%,Цель 3 - достигнута на 50%, Цель 4 - достигнута на 25%, Цель 5 - достигнута на 100%...'
    ],
    'ru/blog/books-2023' => [
        'title' => 'Ревизия моей библиотеки: удаление и добавление книг, приоритеты и статистика чтения в 2023 году',
        'metaDescription' => 'В этой статье я рассказываю о ревизии моей библиотеки, удалении ненужных книг и добавлении новых. Узнайте о моих приоритетах, статистике чтения в 2023 году и рекомендациях по лучшим книгам.',
        'h1' => 'Книжная статистика за 2023 год',
        'url' => 'https://shitik.com/ru/blog/books-2023',
        'preview' => 'https://shitik.com/images/blog/2023/books-2023/books-2023.jpg',
        'date' => [
            'htmlFormat' => '2023-12-29',
            'viewFormat' => '29 декабря 2023',
        ],
        'titleForIndexBlog' => 'Книжная статистика за 2023 год',
        'descriptionForIndexBlog' => 'В этом году я провел ревизию своих книг: удалил часть того, что точно не буду читать и вместе с этим скачал около 400 новых книг. Уже в момент скачивания я обращал...'
    ],
    'ru/blog/run-2023' => [
        'title' => 'Статистика моего бега в 2023 году: рекордное расстояние и интересные графики',
        'metaDescription' => 'В этой статье я подводю итоги своего бега в 2023 году. Узнайте, какое расстояние я пробежал, какие рекорды установил и какие графики отображают мои достижения.',
        'h1' => 'Статистика бега за 2023 год',
        'url' => 'https://shitik.com/ru/blog/run-2023',
        'preview' => 'https://shitik.com/images/blog/2023/run-2023/run-2023.jpg',
        'date' => [
            'htmlFormat' => '2023-12-27',
            'viewFormat' => '27 декабря 2023',
        ],
        'titleForIndexBlog' => 'Статистика бега за 2023 год',
        'descriptionForIndexBlog' => 'Конец года, а значит самое время подвести статистику моего бега. И хоть в этом году у меня была краткосрочная, но очень неприятная болезнь, это не сильно отразилось на моем беге в этом году...'
    ],
    'ru/blog/tips-for-motorists' => [
     'title' => 'Неочевидные советы для начинающих водителей: избегайте распространенных ошибок',
        'metaDescription' => 'Изучите неочевидные и полезные советы для начинающих водителей, которые помогут вам избежать неприятностей на дороге. Собранные из жизненного опыта автора, эти советы дополнят вашу подготовку к вождению и повысят вашу безопасность. Будьте внимательны и готовы к непредвиденным ситуациям, чтобы стать опытным водителем.',
        'h1' => 'Неочевидные советы начинающим водителям',
        'url' => 'https://shitik.com/ru/blog/tips-for-motorists',
        'preview' => 'https://shitik.com/images/blog/2023/tips-for-motorists/tips-for-motorists.jpg',
        'date' => [
            'htmlFormat' => '2023-12-26',
            'viewFormat' => '26 декабря 2023',
        ],
        'titleForIndexBlog' => 'Неочевидные советы начинающим водителям',
        'descriptionForIndexBlog' => 'В начале этого года у меня вышла статья, почему водители не любят зиму. В продолжение этой тематики решил написать еще одну.В автошколе помимо изучения ПДД и практики тот, кто ведет лекции, часто рассказывает свои негласные правила...'
    ],
    'ru/blog/fear-of-criticism' => [
        'title' => 'Почему мы следуем моде: психологический анализ и симптомы страха перед критикой',
        'metaDescription' => 'В этой статье мы исследуем, почему многие люди стремятся быть модными и менять свою одежду и вещи регулярно. Мы рассмотрим психологическую проблему, связанную с потребностью в моде, и описываем 7 симптомов страха перед критикой. Если вы замечаете себя в этих симптомах, возможно, вам стоит обратить внимание и позаботиться о своей уверенности и самооценке.',
        'h1' => 'Страх перед критикой или почему люди гоняться за модой',
        'url' => 'https://shitik.com/ru/blog/fear-of-criticism',
        'preview' => 'https://shitik.com/images/blog/2023/fear-of-criticism/fear-of-criticism.jpg',
        'date' => [
            'htmlFormat' => '2023-12-23',
            'viewFormat' => '23 декабря 2023',
        ],
        'titleForIndexBlog' => 'Страх перед критикой или почему люди гоняться за модой',
        'descriptionForIndexBlog' => 'Мне всегда была интересно, почему многие люди гонятся за модой. И ладно если бы новая вещь была на несколько поколений новее чем та, которая у тебя есть. iPhone 14 конечно же более современный, чем например 8. А автомобиль 2020 года как правило всегда комфортнее и безопаснее, чем автомобиль 2000 года или хотя бы 2010 года...'
    ],
    'ru/blog/space-objects' => [
        'title' => 'Изучение космоса: открытия и технологии, которые изменили нашу повседневную жизнь',
        'metaDescription' => 'Узнайте, как изучение космоса стимулирует прогресс и приводит к разработке новых технологий. Изобретения, созданные для космических целей, нашли применение в повседневной жизни. От складных транспортных средств до солнечных батарей и компактных датчиков - узнайте о том, как космос влияет на нашу технологическую эволюцию.',
        'h1' => 'Бытовые и медицинские предметы, которые появились благодаря изучению космоса',
        'url' => 'https://shitik.com/ru/blog/space-objects',
        'preview' => 'https://shitik.com/images/blog/2023/space-objects/space-objects.jpg',
        'date' => [
            'htmlFormat' => '2023-12-16',
            'viewFormat' => '16 декабря 2023',
        ],
        'titleForIndexBlog' => 'Бытовые и медицинские предметы, которые появились благодаря изучению космоса',
        'descriptionForIndexBlog' => 'Одну из первых статей про изучение космоса я начну с того, что само по себе изучение космоса является двигателем человеческого прогресса и улучшения повседневного быта человека. Астрономия - эта та отрасль, которая занимает огромную статью годового бюджета...'
    ],
    'ru/blog/following-in-the-footsteps-of-hocking-and-tyson' => [
        'title' => 'Изучение космоса: загадки вселенной и шокирующие открытия',
        'metaDescription' => 'Откройте для себя загадочную вселенную и тайны человеческой натуры. Узнайте, как появилась вселенная и является ли она бесконечной. Погрузитесь в мир космоса и узнайте о последних открытиях, которые могут шокировать вас. Будьте в курсе новейших исследований и развития космологии. Подпишитесь на блог и получайте регулярные обновления о захватывающих открытиях и событиях в космосе.',
        'h1' => 'Иду по стопам Хокинга и Тайсона',
        'url' => 'https://shitik.com/ru/blog/following-in-the-footsteps-of-hocking-and-tyson',
        'preview' => 'https://shitik.com/images/blog/2023/following-in-the-footsteps-of-hocking-and-tyson/following-in-the-footsteps-of-hocking-and-tyson.jpg',
        'date' => [
            'htmlFormat' => '2023-12-9',
            'viewFormat' => '9 декабря 2023',
        ],
        'titleForIndexBlog' => 'Иду по стопам Хокинга и Тайсона',
        'descriptionForIndexBlog' => 'Некоторые люди считают человека загадочным существом, ставят его в центр существования вселенной и стремятся познать все тайны человеческой натуры. Такие люди изучают психологию. Некоторые люди идут еще дальше и считают изучение самой вселенной более интересной затеей. Как вы могли понять...'
    ],
    'ru/blog/winning-lotteries' => [
        'title' => 'Выигрышные минские лотереи. Секрет ракскрыт.',
        'metaDescription' => 'Разбираем почему в Минске и области лотерии выигрывают чаще, чем в других регионам Беларуси',
        'h1' => 'Выигрышные минские лотереи',
        'url' => 'https://shitik.com/ru/blog/winning-lotteries',
        'preview' => 'https://shitik.com/images/blog/2023/winning-lotteries/winning-lotteries.jpg',
        'date' => [
            'htmlFormat' => '2023-08-12',
            'viewFormat' => '12 августа 2023',
        ],
        'titleForIndexBlog' => 'Выигрышные минские лотереи',
        'descriptionForIndexBlog' => 'В моем детстве и подростков возрасте были очень популярные лотереи ваше лото и супер лото. Не знаю судьбы этих лотереей сейчас, возможно какая-то из них существует и сейчас...'
    ],
    'ru/blog/weight-and-mass' => [
        'title' => 'Вес или масса? Как правильно?',
        'metaDescription' => 'Как правильно говорить вес или масса. Разбираем оба понятия.',
        'h1' => 'Почему некорректно спрашивать какой у тебя вес? Отсеиваем двоечников по физике',
        'url' => 'https://shitik.com/ru/blog/weight-and-mass',
        'preview' => 'https://shitik.com/images/blog/2023/weight-and-mass/weight-and-mass.jpg',
        'date' => [
            'htmlFormat' => '2023-08-11',
            'viewFormat' => '11 августа 2023',
        ],
        'titleForIndexBlog' => 'Почему некорректно спрашивать какой у тебя вес? Отсеиваем двоечников по физике.',
        'descriptionForIndexBlog' => 'Очень часто можно услышать фразу какой у тебя вес?  Давайте разберемся что с ней не так и почему она максимально странная. В самой по себе фразе-вопросе...'
    ],
    'ru/blog/marvel-and-dc-without-a-plot' => [
        'title' => 'Кризис идей и проблемы с сюжетом у компаний Marvel и DC',
        'metaDescription' => 'Какие типовые проблему я обнаружил в сюжетных линиях ведуших компаниях, снимающих фильмы по комиксам.',
        'h1' => 'Кризис идей и проблемы с сюжетом у Марвел и DC',
        'url' => 'https://shitik.com/ru/blog/marvel-and-dc-without-a-plot',
        'preview' => 'https://shitik.com/images/blog/2023/marvel-and-dc-without-a-plot/marvel-and-dc-without-a-plot.jpg',
        'date' => [
            'htmlFormat' => '2023-08-06',
            'viewFormat' => '6 августа 2023',
        ],
        'titleForIndexBlog' => 'Кризис идей и проблемы с сюжетом у Марвел и DC',
        'descriptionForIndexBlog' => 'Я не большой фанат серии Marvel и DC, но некоторые самые популярные и хайповые фильмы все же видел. Это и не удивительно, ведь ровно как...'
    ],
    'ru/blog/rich-brazil-and-argentina' => [
        'title' => 'Если бы у Бразилии и Аргентины было больше денег',
        'metaDescription' => 'Что было бы, если бы Бразилия и Аргентина были более богатыми и экономически успешными странами.',
        'h1' => 'Если бы Бразилия и Аргентина были богаче',
        'url' => 'https://shitik.com/ru/blog/rich-brazil-and-argentina',
        'preview' => 'https://shitik.com/images/blog/2023/rich-brazil-and-argentina/rich-brazil-and-argentina.jpg',
        'date' => [
            'htmlFormat' => '2023-08-05',
            'viewFormat' => '5 августа 2023',
        ],
        'titleForIndexBlog' => 'Если бы у Бразилии и Аргентины было больше денег',
        'descriptionForIndexBlog' => 'Те, кто давно увлекается футболом пережил самые разные тенденции вливания денег в футбол. Я начал увлекаться футболом в начале нулевых. Всегда самыми лучшими клубами мира являлись...'
    ],
    'ru/blog/immediate-reward' => [
        'title' => 'Общество с немедленным откликом и вознаграждением',
        'metaDescription' => 'Рассмотрим сравнение людей с немедленным и отложенным отклик о мами. Разберем почему в обществе многие живут с немедленным откликом',
        'h1' => 'Общество с немедленным вознаграждением',
        'url' => 'https://shitik.com/ru/blog/immediate-reward',
        'preview' => 'https://shitik.com/images/blog/2023/immediate-reward/immediate-reward.jpg',
        'date' => [
            'htmlFormat' => '2023-06-10',
            'viewFormat' => '10 июня 2023',
        ],
        'titleForIndexBlog' => 'Общество с немедленным вознаграждением',
        'descriptionForIndexBlog' => 'Не так давно я прочил книгу Джеймса Клира про то как привить хорошие привычки и избавиться от плохих. Не скажу, что это идеи основного посыла книги меня сильно впечатлили, но в целом...'
    ],
    'ru/blog/kidney-stone' => [
        'title' => 'Камень в почках.',
        'metaDescription' => 'История о том как у меня камень выходил из почки.',
        'h1' => 'Как у меня камень из почки выходил',
        'url' => 'https://shitik.com/ru/blog/kidney-stone',
        'preview' => 'https://shitik.com/images/blog/2023/kidney-stone/kidney-stone.jpg',
        'date' => [
            'htmlFormat' => '2023-06-03',
            'viewFormat' => '03 июня 2023',
        ],
        'titleForIndexBlog' => 'Как у меня камень из почки выходил',
        'descriptionForIndexBlog' => 'Несколько недель назад я проснулся в субботнее утром и практически сразу ощутил острую боль в районе живота. Наверняка каждый может представить...'
    ],
    'ru/blog/expensive-apartment-renovation' => [
        'title' => 'Ремонт квартиры за 50 000$. Результаты и описание.',
        'metaDescription' => 'Детальная статья с описанием ремонта моей двухкомнатной квартиры в Минске. Куда ушли 50 000$ и что было куплено на эту сумму в квартиру?',
        'h1' => 'Результаты ремонта квартиры',
        'url' => 'https://shitik.com/ru/blog/expensive-apartment-renovation',
        'preview' => 'https://shitik.com/images/blog/2023/expensive-apartment-renovation/expensive-apartment-renovation.jpg',
        'date' => [
            'htmlFormat' => '2023-04-08',
            'viewFormat' => '8 апреля 2023',
        ],
        'titleForIndexBlog' => 'Результаты ремонта квартиры',
        'descriptionForIndexBlog' => 'Продолжение статьи про выбор и покупку квартиры настало время написать детали по ремонту квартиры. Статья выходит более чем, через год после выхода прошлой, однако...'
    ],

    'ru/blog/scrum-and-sprint-life' => [
        'title' => 'Скрам в личной жизни',
        'metaDescription' => 'На протяжении последних 5-7 лет в поисках эффективного выполнения задач и целей используемые мной программы хранения заметок менялись уже несколько раз. В этой статье подробно разбираю как и почему я начал использовать Scrum в личной жизни.',
        'h1' => 'Жизнь по скраму со спринтами',
        'url' => 'https://shitik.com/ru/blog/scrum-and-sprint-life',
        'preview' => 'https://shitik.com/images/blog/2023/scrum-and-sprint-life/scrum-and-sprint-life.jpg',
        'date' => [
            'htmlFormat' => '2023-04-03',
            'viewFormat' => '3 апреля 2023',
        ],
        'titleForIndexBlog' => 'Жизнь по скраму со спринтами',
        'descriptionForIndexBlog' => 'На протяжении последних 7 лет я активно планирую различные долгосрочные цели 📝 на каждый год, а также последних лет 5 я активно планирую и расписываю краткосрочные задачи. За последнюю пятилетку мои инструменты претерпели немало изменений...'
    ],

    'ru/blog/monopolies' => [
        'title' => 'Монополия, а не конкуренция двигает прогрессом',
        'metaDescription' => 'Разбираю интересную точку зрения основателя PayPal Питера Тиля о том, что монополия лучше конкуренции.',
        'h1' => 'Монополия лучше конкуренции?',
        'url' => 'https://shitik.com/ru/blog/monopolies',
        'preview' => 'https://shitik.com/images/blog/2023/monopolies/monopolies.jpg',
        'date' => [
            'htmlFormat' => '2023-03-28',
            'viewFormat' => '28 марта 2023',
        ],
        'titleForIndexBlog' => 'Монополия лучше конкуренции?',
        'descriptionForIndexBlog' => 'Наверняка вы часто слышали, что именно конкуренция является двигателем прогресса. Всегда ли это утверждение верно? До недавнего времени я считал именно так. Но в книге одного из создателей PayPal...'
    ],

    'ru/blog/does-the-soul-exist' => [
        'title' => 'Существует ли душа человека?',
        'metaDescription' => 'Рассуждение на тему существования души с научной и логической точек зрения после того как я потерял одного из родственников.',
        'h1' => 'Существует ли душа?',
        'url' => 'https://shitik.com/ru/blog/does-the-soul-exist',
        'preview' => 'https://shitik.com/images/blog/2023/does-the-soul-exist/does-the-soul-exist.jpg',
        'date' => [
            'htmlFormat' => '2023-03-25',
            'viewFormat' => '25 марта 2023',
        ],
        'titleForIndexBlog' => 'Существует ли душа?',
        'descriptionForIndexBlog' => 'Пожалуй лучше бы этой статьи вообще не было. Не так давно у меня умер родственник и именно это печальное событие стало триггером для написания данной статьи. е так давно я смотрел видео о современных возможностях медицины и возвращении людей после остановки сердца...'
    ],

    'ru/blog/earth-overpopulation' => [
        'title' => 'Перенаселение Земли. Странности и краткие факты',
        'metaDescription' => 'Рассуждение о том, действительно ли планете грозит перенаселение, у каких стран большие проблемы и предположение что будет с населением Земли в будущем?',
        'h1' => 'Странности с перенаселением Земли',
        'url' => 'https://shitik.com/ru/blog/earth-overpopulation',
        'preview' => 'https://shitik.com/images/blog/2023/earth-overpopulation/earth-overpopulation.jpg',
        'date' => [
            'htmlFormat' => '2023-03-22',
            'viewFormat' => '22 марта 2023',
        ],
        'titleForIndexBlog' => 'Странности с перенаселением Земли',
        'descriptionForIndexBlog' => 'В этом посту я хочу затронуть тему перенаселения Земли. Несколько месяцев назад население нашей планеты перевалило за 8 миллиардов человек. Если добавить сюда все экологические проблемы и прогнозы с перенаселением Земли на ближайшие...'
    ],

    'ru/blog/car-in-winter' => [
        'title' => 'Почему автомобилисты не любят зиму - 21 причина',
        'metaDescription' => 'Подробное описание распространенных проблем, которые могут случиться зимой с вашем авто',
        'h1' => 'Почему водители не любят зиму?',
        'url' => 'https://shitik.com/ru/blog/car-in-winter',
        'preview' => 'https://shitik.com/images/blog/2023/car-in-winter/car-in-winter.jpg',
        'date' => [
            'htmlFormat' => '2023-02-12',
            'viewFormat' => '12 февраля 2023',
        ],
        'titleForIndexBlog' => 'Почему водители не любят зиму?',
        'descriptionForIndexBlog' => 'Зима чудесное время года. Кругом лежит белый снег, на окнах мороз, и ты можешь идти по улице и наслаждаться красивыми пейзажами природы в ожидании Нового Года...'
    ],

    'ru/blog/total-2022' => [
        'title' => 'Итоги моего 2022 года',
        'metaDescription' => 'Подвел итоги уходящего года. Интересные факты 2022 года',
        'h1' => 'Чем я занимался в 2022 году',
        'url' => 'https://shitik.com/ru/blog/total-2022',
        'preview' => 'https://shitik.com/images/blog/2023/total-2022/total-2022.jpg',
        'date' => [
            'htmlFormat' => '2023-01-06',
            'viewFormat' => '6 января 2023',
        ],
        'titleForIndexBlog' => 'Итоги моего 2022 года',
        'descriptionForIndexBlog' => '2022 прошел, а значит пора подводить итоги года. Как и несколько предыдущих лет я досконально документирую многие вещи. Мой слоган года был не самый приятный...'
    ],

    // 2022
    'ru/blog/books-2022' => [
        'title' => '22 книги в 22ом году!',
        'metaDescription' => 'Полный список книг, которые успел прочитать за 2022 год.',
        'h1' => 'Прочитанные книги в 2022 году',
        'url' => 'https://shitik.com/ru/blog/books-2022',
        'preview' => 'https://shitik.com/images/blog/2022/books-2022/books-2022.jpg',
        'date' => [
            'htmlFormat' => '2022-12-29',
            'viewFormat' => '29 декабря 2022',
        ],
        'titleForIndexBlog' => 'Прочитанные книги в 2022 году',
        'descriptionForIndexBlog' => 'Текущий год не обошелся без массового чтения книг. К сожалению по ряду причин количество прочитанных книг в этом году по сравнению с...'
    ],

    'ru/blog/run-2022' => [
        'title' => 'Итоги бега за 2022 год',
        'metaDescription' => 'Результаты бега за 2022 год. Сравнение показателей с предыдущими годами',
        'h1' => 'Результаты бега за 2022',
        'url' => 'https://shitik.com/ru/blog/run-2022',
        'preview' => 'https://shitik.com/images/blog/2022/run-2022/run-2022.jpg',
        'date' => [
            'htmlFormat' => '2022-12-28',
            'viewFormat' => '28 декабря 2022',
        ],
        'titleForIndexBlog' => 'Результаты бега за 2022',
        'descriptionForIndexBlog' => 'Пришло время подвести итоги бегового 2022 года. Сначала рассмотрим таблицу всех пробежек в году, после чего дам некоторые комментарии...'
    ],

    'ru/blog/world-cup-2022' => [
        'title' => 'Стать Чемпионата мира по футболу 2022',
        'metaDescription' => 'В Катаре совсем скоро стартует чемпионата мира по футболу 2022. Ценность соревнования, главные фавориты, бомбордиры и прочие факты',
        'h1' => 'Чемпионат мира по футболу 2022',
        'url' => 'https://shitik.com/ru/blog/world-cup-2022',
        'preview' => 'https://shitik.com/images/blog/2022/world-cup-2022/world-cup-2022.jpg',
        'date' => [
            'htmlFormat' => '2022-01-18',
            'viewFormat' => '18 ноября 2022',
        ],
        'titleForIndexBlog' => 'Чемпионат мира по футболу 2022',
        'descriptionForIndexBlog' => 'На днях стартует чемпионат мира по футболу. Это самое ценное и важное соревнование в карьере каждого футболиста. Ценность добавляет то, что в отличие от многих других видов спорта чемпионат мира по футболу...'
    ],

    'ru/blog/seo' => [
        'title' => 'Современные поисковые системы',
        'metaDescription' => 'Что не так с соверменными поисковыми системами? Поисковые системы будущего.',
        'h1' => 'Современная СЕО-оптимизация глазами программиста',
        'url' => 'https://shitik.com/ru/blog/seo',
        'preview' => 'https://shitik.com/images/blog/2022/seo/seo.jpg',
        'date' => [
            'htmlFormat' => '2022-07-16',
            'viewFormat' => '16 июля 2022',
        ],
        'titleForIndexBlog' => 'Современная СЕО-оптимизация глазами программиста',
        'descriptionForIndexBlog' => 'Уже около 5ти лет я работаю в продуктовой компании в области финансов, экономики и бизнеса. Помимо этой предметной области у нас есть вторая не менее важная...'
    ],

    // 2021
    'ru/blog/total-2021' => [
        'title' => 'Итоги моего 2021 года',
        'metaDescription' => 'Подвел итоги уходящего года. Интересные факты уходящего года',
        'h1' => 'Чем я занимался в 2021 году',
        'url' => 'https://shitik.com/ru/blog/total-2021',
        'preview' => 'https://shitik.com/images/blog/2021/total-2021/total-2021.jpg',
        'date' => [
            'htmlFormat' => '2021-12-21',
            'viewFormat' => '29 декабря 2021',
        ],
        'titleForIndexBlog' => 'Итоги моего 2021 года',
        'descriptionForIndexBlog' => 'Конец декабря. Самое время подвести итоги уходящего года и так как я до мозга костей технарь многие цели и просто показатели я документировал...'
    ],

    'ru/blog/run-2021' => [
        'title' => 'Итоги бега за 2021 год',
        'metaDescription' => 'Результаты бега за текущий год. Сравнение показателей с предыдущими годами',
        'h1' => 'Результаты бега за 2021',
        'url' => 'https://shitik.com/ru/blog/run-2021',
        'preview' => 'https://shitik.com/images/blog/2021/run-2021/run-2021.jpg',
        'date' => [
            'htmlFormat' => '2021-12-21',
            'viewFormat' => '21 декабря 2021',
        ],
        'titleForIndexBlog' => 'Результаты бега за 2021',
        'descriptionForIndexBlog' => 'Этот год был весьма успешным в плане бега, я на своем организме прочувствовал как прибавил почти во всех показателях. Рассмотрим ниже все пробежки...'
    ],

    'ru/blog/kinopoisk-250' => [
        'title' => 'Пересмотрел топ 250 на кинопоиске',
        'metaDescription' => 'Впечатления от просмотра топ 250 фильмов по версии кинопоиска.',
        'h1' => 'Мысли после просмотра 250 лучших фильмов кинопоиска',
        'url' => 'https://shitik.com/ru/blog/kinopoisk-250',
        'preview' => 'https://shitik.com/images/blog/2021/kinopoisk-250/kinopoisk-250.jpg',
        'date' => [
            'htmlFormat' => '2021-12-18',
            'viewFormat' => '18 декабря 2021',
        ],
        'titleForIndexBlog' => 'Мысли после просмотра 250 лучших фильмов кинопоиска',
        'descriptionForIndexBlog' => 'По мнению друзей статья про фильмы IMDb написанная в прошлом году была одной из моих лучших. Там я описал свои впечатления от просмотра культовых фильмов всех времен...'
    ],

    'ru/blog/books-2021' => [
        'title' => 'Еще 30 книг за 11 месяцев',
        'metaDescription' => 'Список книг, которые успел прочитать за 11 месяцев 2021 года.',
        'h1' => 'Прочитанные книги в 2021 году',
        'url' => 'https://shitik.com/ru/blog/books-2021',
        'preview' => 'https://shitik.com/images/blog/2021/books-2021/books-2021.jpg',
        'date' => [
            'htmlFormat' => '2021-12-05',
            'viewFormat' => '05 декабря 2021',
        ],
        'titleForIndexBlog' => 'Прочитанные книги в 2021 году',
        'descriptionForIndexBlog' => 'В текущем году я прочитал 30 книг, что на 2 меньше чем в прошлом году. Думаю это было связано с путешествием в Новосибирск и Алтай, плюс сказалась покупка квартиры и последующий...'
    ],

    'ru/blog/run-2018-2020' => [
        'title' => 'Статистика моего бега за 2018-2020',
        'metaDescription' => 'Статистика моего бега за вторую половину 2018 года, а также за 2019 и 2020 года.',
        'h1' => 'Статистика моего бега за 2.5 года',
        'url' => 'https://shitik.com/ru/blog/run-2018-2020',
        'preview' => 'https://shitik.com/images/blog/2021/run-2018-2020/run-2018-2020.jpg',
        'date' => [
            'htmlFormat' => '2021-12-04',
            'viewFormat' => '04 декабря 2021',
        ],
        'titleForIndexBlog' => 'Статистика моего бега за 2.5 года',
        'descriptionForIndexBlog' => 'После активного спортивного детства и подросткового возраста я закинул спорт буквально на 4-5 лет после чего мое здоровье слегка ухудшилось. Врачи даже поставили мне тахикардию (учащенное сердцебиение), но я не стал...'
    ],

    'ru/blog/people-without-food' => [
        'title' => 'Рассуждение как изменилась бы человество, если бы мы не нуждались в еде',
        'metaDescription' => 'Человеческий цивилизация слишкам слаба и зависима от разных факторов: наличие кислород в нужной объеме, подходящие давление и температура, защита от радиации',
        'h1' => 'Если бы люди не нуждались в еде',
        'url' => 'https://shitik.com/ru/blog/people-without-food',
        'preview' => 'https://shitik.com/images/blog/2021/people-without-food//people-without-food.jpg',
        'date' => [
            'htmlFormat' => '2021-10-30',
            'viewFormat' => '30 октября 2021',
        ],
        'titleForIndexBlog' => 'Если бы люди не нуждались в еде',
        'descriptionForIndexBlog' => 'Человеческий цивилизация слишком слаба и зависима от разных факторов: наличие кислород в нужной объеме, подходящие давление и температура, защита от радиации, постоянная нужда в питье и еде...'
    ],

    'ru/blog/seats-in-the-trolleybus' => [
        'title' => 'Что не так с количеством мест для инвалидов в троллейбусе',
        'metaDescription' => 'По Минску работают очень много троллейбусов модели АКСМ-321. Замечали ли вы соотношение мест для инвалидов по отношению к обычным в данной модели троллейбуса?',
        'h1' => 'Места для инвалидов в троллейбусе',
        'url' => 'https://shitik.com/ru/blog/seats-in-the-trolleybus',
        'preview' => 'https://shitik.com/images/blog/2021/seats-in-the-trolleybus/seats-in-the-trolleybus.jpg',
        'date' => [
            'htmlFormat' => '2021-10-30',
            'viewFormat' => '30 октября 2021',
        ],
        'titleForIndexBlog' => 'Что не так с количеством инвалидных мест в троллейбусе',
        'descriptionForIndexBlog' => 'По Минску работают очень много троллейбусов модели АКСМ-321. Не скажу что каждый день, но достаточно часто и ими пользуюсь для перемещения по городу...'
    ],

    'ru/blog/new-super-heroes' => [
        'title' => 'Новые супер герои. Наш ответ Marvel и DC',
        'metaDescription' => 'Наверняка почти каждый из вас видел хотя бы один из кучи фильмов студий Marvel и DC, где в каждой из них они спасают планету от внутренних и внешних угроз',
        'h1' => 'Наш ответ Marvel и DC',
        'url' => 'https://shitik.com/ru/blog/new-super-heroes',
        'preview' => 'https://shitik.com/images/blog/2021/new-super-heroes/new-super-heroes.jpg',
        'date' => [
            'htmlFormat' => '2021-10-24',
            'viewFormat' => '24 октября 2021',
        ],
        'titleForIndexBlog' => 'Наш ответ Marvel и DC',
        'descriptionForIndexBlog' => 'Согласно древне вавилонским мудростям на глиняных дощечках, которые легли в основу хорошей книги “Самый богатый человек в Вавилоне” одна из них гласит, что любой человек...'
    ],

    'ru/blog/home-bay' => [
        'title' => 'За 2 года я насобирал на свою первую квартиру в Минске',
        'metaDescription' => 'Согласно древне вавилонским мудростям на глиняных дощечках, которые легли в основу хорошей книги “Самый богатый человек в Вавилоне” одна из них гласит, что любой человек должен обзавестись собственных жильем.',
        'h1' => 'Первая квартира',
        'url' => 'https://shitik.com/ru/blog/home-bay',
        'preview' => 'https://shitik.com/images/blog/2021/home-bay/home-bay.jpg',
        'date' => [
            'htmlFormat' => '2021-10-17',
            'viewFormat' => '17 октября 2021',
        ],
        'titleForIndexBlog' => 'Моя первая квартира',
        'descriptionForIndexBlog' => 'Согласно древне вавилонским мудростям на глиняных дощечках, которые легли в основу хорошей книги “Самый богатый человек в Вавилоне” одна из них гласит, что любой человек...'
    ],

    'ru/blog/site-update' => [
        'title' => 'Обновил и доработал свой сайт',
        'metaDescription' => 'Не так давно я обновил свой сайт. Теперь все его разделы снова в одном месте. Среди основных изменяй можно выделить слегка измененный дизайн, расширения сайта и внедрением новых разделов.',
        'h1' => 'Обновление сайта',
        'url' => 'https://shitik.com/ru/blog/site-update',
        'preview' => 'https://shitik.com/images/blog/2021/site-update/site-update.jpg',
        'date' => [
            'htmlFormat' => '2021-09-12',
            'viewFormat' => '12 сентября 2021',
        ],
        'titleForIndexBlog' => 'Обновил и доработал свой сайт',
        'descriptionForIndexBlog' => 'Не так давно я обновил свой сайт. Теперь все его разделы снова в одном месте, однако это технические детали, которые вряд ли кому-то интересны. Так же среди основных изменяй можно выделить слегка измененный дизайн...'
    ],

    'ru/blog/black-lines' => [
        'title' => 'Что я извлек из черной полосы в жизни',
        'metaDescription' => 'Не так давно в моей жизни случился отрезов длинною в 1-2 месяца в котором я сталкнулся с целым рядом проблем.',
        'h1' => 'Моя черная полоса',
        'url' => 'https://shitik.com/ru/blog/black-lines',
        'preview' => 'https://shitik.com/images/blog/2021/black-lines/black-lines.jpg',
        'date' => [
            'htmlFormat' => '2021-08-17',
            'viewFormat' => '17 августа 2021',
        ],
        'titleForIndexBlog' => 'Моя черная полоса',
        'descriptionForIndexBlog' => 'В каком возрасте вы впервые столкнулись с черными полосами в своей жизни? До недавнего времени я не верил в их существование, наверно потому даже живя один и решая самостоятельно свои проблемы они не приходили ко мне...'
    ],
    'ru/blog/run' => [
        'title' => 'Избавился от тахикардии и бегаю по 15-16 километров',
        'metaDescription' => 'Мысли и впечатления о том, как я вернул спортивный образ жизни после 3-4 летнего перерыва.',
        'h1' => 'Новый личный беговой рекорд',
        'url' => 'https://shitik.com/ru/blog/run',
        'preview' => 'https://shitik.com/images/blog/2021/running-record/run.jpg',
        'date' => [
            'htmlFormat' => '2021-04-28',
            'viewFormat' => '28 апреля 2021',
        ],
        'titleForIndexBlog' => 'Новый личный беговой рекорд',
        'descriptionForIndexBlog' => 'Сегодня я установил личный рекорд по бегу. 16 километров 200 метров без единой остановки. Вся эта дистанция далась мне ровно за....<br>Обновлено 18 км 200 метров.'
    ],

    'ru/blog/movies-imdb' => [
        'title' => 'Пересмотрел всю классику мирового кино',
        'metaDescription' => 'Решил поделиться впечатлениями как я пересмотрел всю классику мирового кино от Чаплина до Нолана.',
        'h1' => 'Мысли после просмотра 250 лучших фильмов всех времен',
        'url' => 'https://shitik.com/ru/blog/movies-imdb',
        'preview' => 'https://shitik.com/images/blog/2021/movies-imdb/movies-imdb.jpg',
        'date' => [
            'htmlFormat' => '2021-03-22',
            'viewFormat' => '22 марта 2021',
        ],
        'titleForIndexBlog' => 'Мысли после просмотра 250 лучших фильмов всех времен',
        'descriptionForIndexBlog' => 'Меня всегда слегка пугали люди, которые в stories или других источниках просят друзей и знакомых посоветовать фильм ибо сами не могут его выбрать....'
    ],

    'ru/blog/podcasts' => [
        'title' => 'Обучение через подкасты',
        'metaDescription' => 'Как я отбирал новые подкасты для изучения',
        'h1' => 'Обучение через подкасты',
        'url' => 'https://shitik.com/ru/blog/podcasts',
        'preview' => 'https://shitik.com/images/blog/2021/podcasts/podcasts.jpg',
        'date' => [
            'htmlFormat' => '2021-03-22',
            'viewFormat' => '22 марта 2021',
        ],
        'titleForIndexBlog' => 'Обучение через подкасты',
        'descriptionForIndexBlog' => 'В своих предыдущих статьях я не раз ссылался при самообучении на такие способы как: чтение книг, просмотр Ютуба, разбор ссылок, подкасты. В этой статье речь пойдет как раз о подкастах...'
    ],


    // 2020
    'ru/blog/books-2020' => [
        'title' => 'Впечатления после того как прочил 32 книги за 11 месяцев 2020 года.',
        'metaDescription' => 'Решил поделиться впечатлениями после того как прочил 32 книги за 11 месяцев 2020 года.',
        'h1' => 'Треть сотни книг за 11 месяцев',
        'url' => 'https://shitik.com/ru/blog/books-2020',
        'preview' => 'https://shitik.com/images/blog/2020/books/books.jpg',
        'date' => [
            'htmlFormat' => '2020-12-05',
            'viewFormat' => '5 декабря 2020',
        ],
        'titleForIndexBlog' => 'Треть сотни книг за 11 месяцев',
        'descriptionForIndexBlog' => 'Объявляя личным год 2020 годом “чтения книг” я не ставил перед собой определенные цели по количеству книг. Я хотел еще дальше прокачать свои скиллы по программированию, ведь среди множества направлений...'
    ],

    'ru/blog/planning' => [
        'title' => 'Планирование как степень достижения целей',
        'metaDescription' => 'Коротко о том как я планирую. Заметки, карты анти-деградации, разбиение по типам целей и многое другое',
        'h1' => 'Планирование как степень достижения целей',
        'url' => 'https://shitik.com/ru/blog/planning',
        'preview' => 'https://shitik.com/images/blog/2020/planning/planning.jpg',
        'date' => [
            'htmlFormat' => '2020-08-03',
            'viewFormat' => '3 августа 2020',
        ],
        'titleForIndexBlog' => 'Планирование как степень достижения целей',
        'descriptionForIndexBlog' => 'Ложась в постель перед сном как часто Вы задаете себе вопросы: "На сколько сегодняшний день отличается от остальных?” И "что полезного я сделал сегодня для достижения целей?”...'
    ],

    'ru/blog/koronavirus' => [
        'title' => 'Немного мыслей вслух про коронавирус',
        'metaDescription' => 'Попытаюсь описать реальную картину на сегоняшний день своими глазами',
        'h1' => 'Мои мысли о коронавирусе',
        'url' => 'https://shitik.com/ru/blog/koronavirus',
        'preview' => 'https://shitik.com/images/blog/2020/koronavirus/koronavirus.jpg',
        'date' => [
            'htmlFormat' => '2020-03-12',
            'viewFormat' => '12 марта 2020',
        ],
        'titleForIndexBlog' => 'Мои мысли о коронавирусе',
        'descriptionForIndexBlog' => 'Еще пару недель назад ситуация с коронавирусом была действительно непонятной. Многое зависело от того как развитые страны Европы, США и другие будут готовые встретить коронавирус ибо на примере одного Китая понять это было невозможно...'
    ],


    // 2019
    'ru/blog/students' => [
        'title' => 'Что нужно знать современному программисту',
        'metaDescription' => 'Развернутый ответ на вопрос с полным перечнем технологий, языков, подходов и концепций. Реальный взгляд на будущую профессию от веб-программиста.',
        'h1' => 'Напутствие будущим программистам',
        'url' => 'https://shitik.com/ru/blog/students',
        'preview' => 'https://shitik.com/images/blog/2019/students/students.jpg',
        'date' => [
            'htmlFormat' => '2019-06-12',
            'viewFormat' => '12 июня 2019',
        ],
        'titleForIndexBlog' => 'Напутствие будущим программистам',
        'descriptionForIndexBlog' => 'Не так давно я общался с одной хорошей знакомой, которая учится на программиста. В процессе беседы я понял, что у нее такой же (неправильный на мой взгляд) образ жизни как у большинства других студентов. Такой же как был у меня и всех моих друзей. Дабы помочь ей взглянуть на реальность программирования и мотивировать уже сейчас...'
    ],
];
