<?php

return [
    '04_06_2025' => '"फिल्में" अनुभाग की शुरुआत',
    '06_04_2025' => '"पुस्तकालय" अनुभाग की शुरुआत',
    '13_03_2025' => 'आंतरिक कोडबेस का बड़ा पुनर्निर्माण और रिफैक्टरिंग। 8 भाषाओं का समर्थन।',
    '01_01_2025' => 'अंतर्राष्ट्रीय डोमेन https://shitik.com पर वेबसाइट की शुरुआत।',
    '22_06_2024' => '"ब्लॉग" अनुभाग में पहले 50 पोस्ट।',
    '5_11_2021'  => 'वेबसाइट का पुनः डिज़ाइन।',
    '12_06_2019' => '"ब्लॉग" अनुभाग की पहली पोस्ट।',
    '18_11_2017' => 'डोमेन shitik.by का पंजीकरण। प्रोग्रामिंग और विस्तृत पोर्टफोलियो से संबंधित पोस्ट प्रकाशित।'
];