<?php

return [
    '04_06_2025' => 'Запуск раздела «Фильмы»',
    '06_04_2025' => 'Запуск раздела «Библиотека»',
    '13_03_2025' => 'Масштабная переработка и рефакторинг внутренней кодовой базы. Поддержка 8 языков.',
    '01_01_2025' => 'Запуск сайта на международном доменном имени https://shitik.com.',
    '22_06_2024' => 'Первые 50 постов в разделе «Блог».',
    '5_11_2021' => 'Редизайн сайта.',
    '12_06_2019' => 'Первый пост в разделе «Блог».',
    '18_11_2017' => 'Регистрация домена shitik.by. Публикация постов о программировании, создания подробного портфолио.'
];