<?php

return [
    'year-of-publishing' => 'Год издания',
    'year-of-reading' => 'Год прочтения',
    'my-rating' => 'Моя оценка',
    'number-of-reads' => 'Количество прочтений',
    'total-pages' => 'Количество страниц',
    'pages-of-summary' => 'Конспект (страниц)',
    'read-more' => 'Читать отзыв о книге',
    'categories' => 'Жанры',
    'native-lang' => 'Первоначальный язык издания',
    'other-languages' => 'Переводы на другие языки',
    'none-other-lang' => 'Переводы на другие языки не найдены',
    'languages' => [
        'ru' => 'Русский',
        'en' => 'Английский',
        'de' => 'Немецкий',
        'es' => 'Испанский',
        'fr' => 'Французский',
        'pt' => 'Португальский',
        'zh' => 'Китайский',
        'hi' => 'Хинди',
    ],
    'grade' => [
        'great' => 'Наивысшая',
        'good' => 'Хорошая',
        'normal' => 'Нормальная',
        'bad' => 'Плохая',
    ]

];
